In [1]:
import psycopg2
import sqlite3
import wget
import os

In [2]:
os.listdir()

['.ipynb_checkpoints',
 'README.md',
 'rpg_db (1).sqlite3',
 'rpg_db.sqlite3',
 'titanic.csv',
 'Untitled.ipynb']

In [2]:
# All the information here for clarity
dbname = 'cwmypbdz'
user = 'cwmypbdz'
password = 'rASy8noJg5Hhuhyn0Mxr_XyY2VVYR9zI'
host = 'salt.db.elephantsql.com'

In [3]:
# open a connection and a cursor to postgres db
pg_conn = psycopg2.connect(dbname=dbname, user=user, password=password, host=host)
pg_curs = pg_conn.cursor()

In [5]:
wget.download('https://github.com/LambdaSchool/DS-Unit-3-Sprint-2-SQL-and-Databases/blob/master/module1-introduction-to-sql/rpg_db.sqlite3?raw=true')

100% [............................................................................] 253952 / 253952

'rpg_db (2).sqlite3'

In [6]:
# open a connection and cursor to sqlite db
sl_conn = sqlite3.connect('rpg_db (1).sqlite3')
sl_curs = sl_conn.cursor()

[]

In [8]:
# Get all the character data from the table
characters = sl_curs.execute('SELECT * FROM charactercreator_character;').fetchall()

characters

[(1, 'Aliquid iste optio reiciendi', 0, 0, 10, 1, 1, 1, 1),
 (2, 'Optio dolorem ex a', 0, 0, 10, 1, 1, 1, 1),
 (3, 'Minus c', 0, 0, 10, 1, 1, 1, 1),
 (4, 'Sit ut repr', 0, 0, 10, 1, 1, 1, 1),
 (5, 'At id recusandae expl', 0, 0, 10, 1, 1, 1, 1),
 (6, 'Non nobis et of', 0, 0, 10, 1, 1, 1, 1),
 (7, 'Perferendis', 0, 0, 10, 1, 1, 1, 1),
 (8, 'Accusantium amet quidem eve', 0, 0, 10, 1, 1, 1, 1),
 (9, 'Sed nostrum inventore error m', 0, 0, 10, 1, 1, 1, 1),
 (10, 'Harum repellendus omnis od', 0, 0, 10, 1, 1, 1, 1),
 (11, 'Itaque ut commodi,', 0, 0, 10, 1, 1, 1, 1),
 (12, 'Molestiae quis', 0, 0, 10, 1, 1, 1, 1),
 (13, 'Ali', 0, 0, 10, 1, 1, 1, 1),
 (14, 'Tempora quod optio possimus il', 0, 0, 10, 1, 1, 1, 1),
 (15, 'Sed itaque beatae pari', 0, 0, 10, 1, 1, 1, 1),
 (16, 'Quam dolor', 0, 0, 10, 1, 1, 1, 1),
 (17, 'Molestias expedita', 0, 0, 10, 1, 1, 1, 1),
 (18, 'Lauda', 0, 0, 10, 1, 1, 1, 1),
 (19, 'Incidunt sint perferen', 0, 0, 10, 1, 1, 1, 1),
 (20, 'Laboriosa', 0, 0, 10, 1, 1, 1, 1),
 (21, 'Dolore esse nesciunt fugit com', 0, 0, 10, 1, 1, 1, 1),
 (22, 'Dolorum nam reic', 0, 0, 10, 1, 1, 1, 1),
 (23, 'Repellat ad numquam volu', 0, 0, 10, 1, 1, 1, 1),
 (24, 'Facere enim velit eligend', 0, 0, 10, 1, 1, 1, 1),
 (25, 'Sed ratione quis rep', 0, 0, 10, 1, 1, 1, 1),
 (26, 'Doloribus neque', 0, 0, 10, 1, 1, 1, 1),
 (27, 'Ab voluptas se', 0, 0, 10, 1, 1, 1, 1),
 (28, 'Molestias m', 0, 0, 10, 1, 1, 1, 1),
 (29, 'In pariatur corpori', 0, 0, 10, 1, 1, 1, 1),
 (30, 'Possimus ad dignissimos vel, a', 0, 0, 10, 1, 1, 1, 1),
 (31, 'At minus accusa', 0, 0, 10, 1, 1, 1, 1),
 (32, 'Ad necess', 0, 0, 10, 1, 1, 1, 1),
 (33, 'Expedita c', 0, 0, 10, 1, 1, 1, 1),
 (34, 'Voluptates sunt voluptas volu', 0, 0, 10, 1, 1, 1, 1),
 (35, 'Autem mollitia fuga lauda', 0, 0, 10, 1, 1, 1, 1),
 (36, 'Sint quibusdam ob', 0, 0, 10, 1, 1, 1, 1),
 (37, 'Rerum et o', 0, 0, 10, 1, 1, 1, 1),
 (38, 'Doloribus dolore r', 0, 0, 10, 1, 1, 1, 1),
 (39, 'Eaque su', 0, 0, 10, 1, 1, 1, 1),
 (40, 'Vel molestias numqua', 0, 0, 10, 1, 1, 1, 1),
 (41, 'Iste assumenda repellat q', 0, 0, 10, 1, 1, 1, 1),
 (42, 'Animi labo', 0, 0, 10, 1, 1, 1, 1),
 (43, 'Eum culpa eaque ea omn', 0, 0, 10, 1, 1, 1, 1),
 (44, 'Harum provident vel quam', 0, 0, 10, 1, 1, 1, 1),
 (45, 'Aspe', 0, 0, 10, 1, 1, 1, 1),
 (46, 'Nisi nequ', 0, 0, 10, 1, 1, 1, 1),
 (47, 'Quod tempora', 0, 0, 10, 1, 1, 1, 1),
 (48, 'Porro aliq', 0, 0, 10, 1, 1, 1, 1),
 (49, 'Quas', 0, 0, 10, 1, 1, 1, 1),
 (50, 'Magnam eligendi quia animi', 0, 0, 10, 1, 1, 1, 1),
 (51, 'Officiis se', 0, 0, 10, 1, 1, 1, 1),
 (52, 'Id assumend', 0, 0, 10, 1, 1, 1, 1),
 (53, 'Voluptatibus fu', 0, 0, 10, 1, 1, 1, 1),
 (54, 'Odit rat', 0, 0, 10, 1, 1, 1, 1),
 (55, 'Debit', 0, 0, 10, 1, 1, 1, 1),
 (56, 'Cum aut quas repudia', 0, 0, 10, 1, 1, 1, 1),
 (57, 'Deleniti qui quae quidem', 0, 0, 10, 1, 1, 1, 1),
 (58, 'Adipisci voluptas', 0, 0, 10, 1, 1, 1, 1),
 (59, 'Debitis sit ratione eos nam', 0, 0, 10, 1, 1, 1, 1),
 (60, 'Esse illo molestias archi', 0, 0, 10, 1, 1, 1, 1),
 (61, 'Sunt at itaque voluptatum d', 0, 0, 10, 1, 1, 1, 1),
 (62, 'Est totam', 0, 0, 10, 1, 1, 1, 1),
 (63, 'Reprehenderit commodi eius', 0, 0, 10, 1, 1, 1, 1),
 (64, 'Debit', 0, 0, 10, 1, 1, 1, 1),
 (65, 'Soluta dol', 0, 0, 10, 1, 1, 1, 1),
 (66, 'Vel nesc', 0, 0, 10, 1, 1, 1, 1),
 (67, 'Ratione quia ali', 0, 0, 10, 1, 1, 1, 1),
 (68, 'Rerum recusandae minima', 0, 0, 10, 1, 1, 1, 1),
 (69, 'Totam natus eius fugiat volu', 0, 0, 10, 1, 1, 1, 1),
 (70, 'Perferendis commodi null', 0, 0, 10, 1, 1, 1, 1),
 (71, 'Laudantiu', 0, 0, 10, 1, 1, 1, 1),
 (72, 'Voluptat', 0, 0, 10, 1, 1, 1, 1),
 (73, 'Incidunt nesciun', 0, 0, 10, 1, 1, 1, 1),
 (74, 'Illum amet vero', 0, 0, 10, 1, 1, 1, 1),
 (75, 'Suscipit exercitationem re', 0, 0, 10, 1, 1, 1, 1),
 (76, 'Quas enim error maxime nisi m', 0, 0, 10, 1, 1, 1, 1),
 (77, 'Labore qu', 0, 0, 10, 1, 1, 1, 1),
 (78, 'Repudiandae deleniti unde', 0, 0, 10, 1, 1, 1, 1),
 (79, 'Ut do', 0, 0, 10, 1, 1, 1, 1),
 (80, 'Quaerat esse labore q', 0, 0, 10, 1, 1, 1, 1),
 (81, 'Quidem aliq', 0, 0, 10, 1, 1, 1, 1),
 (82, 'Aperiam vitae eos dolor sed', 0, 0, 10, 1, 1, 1, 1),
 (83, 'Minus nobis porro', 0, 0, 10, 1, 1, 1, 1),
 (84, 'In similique', 0, 0, 10, 1, 1, 1, 1),
 (85, 'Culpa repellat unde', 0, 0, 10, 1, 1, 1, 1),
 (86, 'Architecto i', 0, 0, 10, 1, 1, 1, 1),
 (87, 'A sed pariatur qua', 0, 0, 10, 1, 1, 1, 1),
 (88, 'Tempore assumenda aperiam', 0, 0, 10, 1, 1, 1, 1),
 (89, 'Sed ullam tempora iusto co', 0, 0, 10, 1, 1, 1, 1),
 (90, 'Ipsa', 0, 0, 10, 1, 1, 1, 1),
 (91, 'Fugiat incidun', 0, 0, 10, 1, 1, 1, 1),
 (92, 'Molestiae of', 0, 0, 10, 1, 1, 1, 1),
 (93, 'Quae quisquam cons', 0, 0, 10, 1, 1, 1, 1),
 (94, 'Repellendus ea non facil', 0, 0, 10, 1, 1, 1, 1),
 (95, 'Quod non quibu', 0, 0, 10, 1, 1, 1, 1),
 (96, 'Numquam velit distinctio', 0, 0, 10, 1, 1, 1, 1),
 (97, 'Necessitatibus nihil ex debi', 0, 0, 10, 1, 1, 1, 1),
 (98, 'Velit tempore nemo, na', 0, 0, 10, 1, 1, 1, 1),
 (99, 'Nesciunt v', 0, 0, 10, 1, 1, 1, 1),
 (100, 'Dicta enim debitis accusantiu', 0, 0, 10, 1, 1, 1, 1),
 (101, 'Vitae a', 0, 0, 10, 1, 1, 1, 1),
 (102, 'Praesentium voluptas u', 0, 0, 10, 1, 1, 1, 1),
 (103, 'Unde ullam mollitia? Nu', 0, 0, 10, 1, 1, 1, 1),
 (104, 'Neque molestias qu', 0, 0, 10, 1, 1, 1, 1),
 (105, 'Officiis es', 0, 0, 10, 1, 1, 1, 1),
 (106, 'Beatae mi', 0, 0, 10, 1, 1, 1, 1),
 (107, 'Mollitia nam corporis temp', 0, 0, 10, 1, 1, 1, 1),
 (108, 'Repudiandae repellat i', 0, 0, 10, 1, 1, 1, 1),
 (109, 'Laboriosam', 0, 0, 10, 1, 1, 1, 1),
 (110, 'Nam minus amet', 0, 0, 10, 1, 1, 1, 1),
 (111, 'Harum quae volup', 0, 0, 10, 1, 1, 1, 1),
 (112, 'Impedit facere ulla', 0, 0, 10, 1, 1, 1, 1),
 (113, 'Enim', 0, 0, 10, 1, 1, 1, 1),
 (114, 'Dolore magni', 0, 0, 10, 1, 1, 1, 1),
 (115, 'Eaque at corpori', 0, 0, 10, 1, 1, 1, 1),
 (116, 'Fug', 0, 0, 10, 1, 1, 1, 1),
 (117, 'Dolorum laudanti', 0, 0, 10, 1, 1, 1, 1),
 (118, 'Perferendis nat', 0, 0, 10, 1, 1, 1, 1),
 (119, 'Cupidi', 0, 0, 10, 1, 1, 1, 1),
 (120, 'Commodi eius dicta digniss', 0, 0, 10, 1, 1, 1, 1),
 (121, 'Debitis eu', 0, 0, 10, 1, 1, 1, 1),
 (122, 'Nihil repella', 0, 0, 10, 1, 1, 1, 1),
 (123, 'Rem quasi minima hic sed anim', 0, 0, 10, 1, 1, 1, 1),
 (124, 'Sed ali', 0, 0, 10, 1, 1, 1, 1),
 (125, 'Earum vol', 0, 0, 10, 1, 1, 1, 1),
 (126, 'Inventore tempore com', 0, 0, 10, 1, 1, 1, 1),
 (127, 'Repell', 0, 0, 10, 1, 1, 1, 1),
 (128, 'Consequatur quis recusandae qu', 0, 0, 10, 1, 1, 1, 1),
 (129, 'Dolores ea velit mi', 0, 0, 10, 1, 1, 1, 1),
 (130, 'Atque blanditiis a aperiam', 0, 0, 10, 1, 1, 1, 1),
 (131, 'Reprehenderit sequi iu', 0, 0, 10, 1, 1, 1, 1),
 (132, 'Natus architecto eos, hic blan', 0, 0, 10, 1, 1, 1, 1),
 (133, 'Ipsa illo quas', 0, 0, 10, 1, 1, 1, 1),
 (134, 'Voluptas ali', 0, 0, 10, 1, 1, 1, 1),
 (135, 'Voluptates obcaecati quod e', 0, 0, 10, 1, 1, 1, 1),
 (136, 'Dolor adipisci a voluptate', 0, 0, 10, 1, 1, 1, 1),
 (137, 'Repellendus natus quae, n', 0, 0, 10, 1, 1, 1, 1),
 (138, 'Laudantium earum nam in dol', 0, 0, 10, 1, 1, 1, 1),
 (139, 'Molestias face', 0, 0, 10, 1, 1, 1, 1),
 (140, 'Maiores suscipit exc', 0, 0, 10, 1, 1, 1, 1),
 (141, 'Illum dolore perferen', 0, 0, 10, 1, 1, 1, 1),
 (142, 'Explicabo recusandae ma', 0, 0, 10, 1, 1, 1, 1),
 (143, 'Odio obcaecati hic nostrum n', 0, 0, 10, 1, 1, 1, 1),
 (144, 'Voluptate ali', 0, 0, 10, 1, 1, 1, 1),
 (145, 'Repudiandae vitae sapiente mol', 0, 0, 10, 1, 1, 1, 1),
 (146, 'Ipsam cumque', 0, 0, 10, 1, 1, 1, 1),
 (147, 'Fugiat quos alias eos dese', 0, 0, 10, 1, 1, 1, 1),
 (148, 'Eaque impe', 0, 0, 10, 1, 1, 1, 1),
 (149, 'Elige', 0, 0, 10, 1, 1, 1, 1),
 (150, 'Adip', 0, 0, 10, 1, 1, 1, 1),
 (151, 'Fuga nemo vel mo', 0, 0, 10, 1, 1, 1, 1),
 (152, 'Libero cumque impedit eveniet', 0, 0, 10, 1, 1, 1, 1),
 (153, 'Odio soluta', 0, 0, 10, 1, 1, 1, 1),
 (154, 'Vero nostrum duc', 0, 0, 10, 1, 1, 1, 1),
 (155, 'Repellend', 0, 0, 10, 1, 1, 1, 1),
 (156, 'Quod', 0, 0, 10, 1, 1, 1, 1),
 (157, 'Suscipit reiciend', 0, 0, 10, 1, 1, 1, 1),
 (158, 'Voluptat', 0, 0, 10, 1, 1, 1, 1),
 (159, 'Porro dolor fuga quam', 0, 0, 10, 1, 1, 1, 1),
 (160, 'Amet quo fugit aliquam sequi', 0, 0, 10, 1, 1, 1, 1),
 (161, 'Magni adipisci veritatis sit q', 0, 0, 10, 1, 1, 1, 1),
 (162, 'Debitis enim cumque cum qu', 0, 0, 10, 1, 1, 1, 1),
 (163, 'Dolorem eligend', 0, 0, 10, 1, 1, 1, 1),
 (164, 'Autem lib', 0, 0, 10, 1, 1, 1, 1),
 (165, 'Saepe assumenda perferendis f', 0, 0, 10, 1, 1, 1, 1),
 (166, 'Deserunt', 0, 0, 10, 1, 1, 1, 1),
 (167, 'Provident soluta simil', 0, 0, 10, 1, 1, 1, 1),
 (168, 'In accu', 0, 0, 10, 1, 1, 1, 1),
 (169, 'Inve', 0, 0, 10, 1, 1, 1, 1),
 (170, 'Placeat sapiente', 0, 0, 10, 1, 1, 1, 1),
 (171, 'Ducimus architecto ullam', 0, 0, 10, 1, 1, 1, 1),
 (172, 'Voluptate tempora rerum', 0, 0, 10, 1, 1, 1, 1),
 (173, 'Totam incidunt earum perspicia', 0, 0, 10, 1, 1, 1, 1),
 (174, 'Optio quas e', 0, 0, 10, 1, 1, 1, 1),
 (175, 'Ab illum invento', 0, 0, 10, 1, 1, 1, 1),
 (176, 'Repellat quis natus totam, s', 0, 0, 10, 1, 1, 1, 1),
 (177, 'Est voluptate accusantium tem', 0, 0, 10, 1, 1, 1, 1),
 (178, 'Beatae q', 0, 0, 10, 1, 1, 1, 1),
 (179, 'Velit', 0, 0, 10, 1, 1, 1, 1),
 (180, 'Minus nequ', 0, 0, 10, 1, 1, 1, 1),
 (181, 'Autem eos voluptates off', 0, 0, 10, 1, 1, 1, 1),
 (182, 'Vel fug', 0, 0, 10, 1, 1, 1, 1),
 (183, 'Architecto repudian', 0, 0, 10, 1, 1, 1, 1),
 (184, 'Opti', 0, 0, 10, 1, 1, 1, 1),
 (185, 'Iust', 0, 0, 10, 1, 1, 1, 1),
 (186, 'Sapiente', 0, 0, 10, 1, 1, 1, 1),
 (187, 'Officiis repellat corrupti su', 0, 0, 10, 1, 1, 1, 1),
 (188, 'Dicta et natus e', 0, 0, 10, 1, 1, 1, 1),
 (189, 'At quos', 0, 0, 10, 1, 1, 1, 1),
 (190, 'Laborum ven', 0, 0, 10, 1, 1, 1, 1),
 (191, 'Exceptur', 0, 0, 10, 1, 1, 1, 1),
 (192, 'Reiciendis assumenda dolo', 0, 0, 10, 1, 1, 1, 1),
 (193, 'Poss', 0, 0, 10, 1, 1, 1, 1),
 (194, 'Acc', 0, 0, 10, 1, 1, 1, 1),
 (195, 'Placeat esse archit', 0, 0, 10, 1, 1, 1, 1),
 (196, 'Enim repellendus nihil est te', 0, 0, 10, 1, 1, 1, 1),
 (197, 'Ipsam incidunt t', 0, 0, 10, 1, 1, 1, 1),
 (198, 'Iure', 0, 0, 10, 1, 1, 1, 1),
 (199, 'Illo en', 0, 0, 10, 1, 1, 1, 1),
 (200, 'A rem ex', 0, 0, 10, 1, 1, 1, 1),
 (201, 'Officiis su', 0, 0, 10, 1, 1, 1, 1),
 (202, 'Numquam molestias', 0, 0, 10, 1, 1, 1, 1),
 (203, 'Voluptates unde', 0, 0, 10, 1, 1, 1, 1),
 (204, 'Quae praesentium vel', 0, 0, 10, 1, 1, 1, 1),
 (205, 'Quas', 0, 0, 10, 1, 1, 1, 1),
 (206, 'Dolores aliquid inv', 0, 0, 10, 1, 1, 1, 1),
 (207, 'Mollitia tempore laborum eaqu', 0, 0, 10, 1, 1, 1, 1),
 (208, 'Nobis voluptates fugiat quia', 0, 0, 10, 1, 1, 1, 1),
 (209, 'Similique dolorem dolore maio', 0, 0, 10, 1, 1, 1, 1),
 (210, 'Sapiente', 0, 0, 10, 1, 1, 1, 1),
 (211, 'Officia nisi dolore', 0, 0, 10, 1, 1, 1, 1),
 (212, 'Distinctio', 0, 0, 10, 1, 1, 1, 1),
 (213, 'Eos quia dignissimos saepe vel', 0, 0, 10, 1, 1, 1, 1),
 (214, 'Ullam neque sint eligendi', 0, 0, 10, 1, 1, 1, 1),
 (215, 'Excepturi deleniti ab a', 0, 0, 10, 1, 1, 1, 1),
 (216, 'Accusa', 0, 0, 10, 1, 1, 1, 1),
 (217, 'Reiciendis laboriosam di', 0, 0, 10, 1, 1, 1, 1),
 (218, 'Delectus ex', 0, 0, 10, 1, 1, 1, 1),
 (219, 'Pari', 0, 0, 10, 1, 1, 1, 1),
 (220, 'Veritatis velit facilis iste', 0, 0, 10, 1, 1, 1, 1),
 (221, 'Dol', 0, 0, 10, 1, 1, 1, 1),
 (222, 'Qui iste pr', 0, 0, 10, 1, 1, 1, 1),
 (223, 'Deleni', 0, 0, 10, 1, 1, 1, 1),
 (224, 'Reprehenderit volu', 0, 0, 10, 1, 1, 1, 1),
 (225, 'Accusantium vitae n', 0, 0, 10, 1, 1, 1, 1),
 (226, 'Natus consequatur incidun', 0, 0, 10, 1, 1, 1, 1),
 (227, 'Dignissimos a', 0, 0, 10, 1, 1, 1, 1),
 (228, 'Vitae modi', 0, 0, 10, 1, 1, 1, 1),
 (229, 'Accusantium qu', 0, 0, 10, 1, 1, 1, 1),
 (230, 'Reiciendis dignissimos ratio', 0, 0, 10, 1, 1, 1, 1),
 (231, 'Expedita provident natus volup', 0, 0, 10, 1, 1, 1, 1),
 (232, 'Rerum repellat voluptas c', 0, 0, 10, 1, 1, 1, 1),
 (233, 'Maiores quos incidunt dolor', 0, 0, 10, 1, 1, 1, 1),
 (234, 'Aper', 0, 0, 10, 1, 1, 1, 1),
 (235, 'Nulla', 0, 0, 10, 1, 1, 1, 1),
 (236, 'Laudantium tempora itaque', 0, 0, 10, 1, 1, 1, 1),
 (237, 'Reprehenderit', 0, 0, 10, 1, 1, 1, 1),
 (238, 'Aliqu', 0, 0, 10, 1, 1, 1, 1),
 (239, 'Odio harum nam mole', 0, 0, 10, 1, 1, 1, 1),
 (240, 'Arc', 0, 0, 10, 1, 1, 1, 1),
 (241, 'Reprehenderit li', 0, 0, 10, 1, 1, 1, 1),
 (242, 'Repr', 0, 0, 10, 1, 1, 1, 1),
 (243, 'Optio m', 0, 0, 10, 1, 1, 1, 1),
 (244, 'Esse odit amet rep', 0, 0, 10, 1, 1, 1, 1),
 (245, 'Provident nostrum minima', 0, 0, 10, 1, 1, 1, 1),
 (246, 'Ex nihil quae facilis a omni', 0, 0, 10, 1, 1, 1, 1),
 (247, 'Dolorem quaerat sunt', 0, 0, 10, 1, 1, 1, 1),
 (248, 'Distinctio', 0, 0, 10, 1, 1, 1, 1),
 (249, 'Repudiandae ip', 0, 0, 10, 1, 1, 1, 1),
 (250, 'Iste debitis dolorum amet m', 0, 0, 10, 1, 1, 1, 1),
 (251, 'Non qui vo', 0, 0, 10, 1, 1, 1, 1),
 (252, 'Dolorem ma', 0, 0, 10, 1, 1, 1, 1),
 (253, 'Molestias labore tempore ita', 0, 0, 10, 1, 1, 1, 1),
 (254, 'Vol', 0, 0, 10, 1, 1, 1, 1),
 (255, 'Adipisci molest', 0, 0, 10, 1, 1, 1, 1),
 (256, 'Omni', 0, 0, 10, 1, 1, 1, 1),
 (257, 'Voluptatibus dolor', 0, 0, 10, 1, 1, 1, 1),
 (258, 'Quo', 0, 0, 10, 1, 1, 1, 1),
 (259, 'Atque aspernatur possi', 0, 0, 10, 1, 1, 1, 1),
 (260, 'Ullam c', 0, 0, 10, 1, 1, 1, 1),
 (261, 'Iusto quas voluptatibu', 0, 0, 10, 1, 1, 1, 1),
 (262, 'Optio qui sunt dolores, ab', 0, 0, 10, 1, 1, 1, 1),
 (263, 'Illum recusandae nulla re', 0, 0, 10, 1, 1, 1, 1),
 (264, 'Verita', 0, 0, 10, 1, 1, 1, 1),
 (265, 'Expedita quod blanditiis', 0, 0, 10, 1, 1, 1, 1),
 (266, 'Mag', 0, 0, 10, 1, 1, 1, 1),
 (267, 'Omnis quos aspernatur d', 0, 0, 10, 1, 1, 1, 1),
 (268, 'Sunt impedit co', 0, 0, 10, 1, 1, 1, 1),
 (269, 'Minima quam ea ad', 0, 0, 10, 1, 1, 1, 1),
 (270, 'Suscipit quidem e', 0, 0, 10, 1, 1, 1, 1),
 (271, 'Harum', 0, 0, 10, 1, 1, 1, 1),
 (272, 'Dolore laborum ips', 0, 0, 10, 1, 1, 1, 1),
 (273, 'Magni veniam earum corporis', 0, 0, 10, 1, 1, 1, 1),
 (274, 'Optio', 0, 0, 10, 1, 1, 1, 1),
 (275, 'Nam fugit vel.', 0, 0, 10, 1, 1, 1, 1),
 (276, 'Ut numquam quam eum, alias ius', 0, 0, 10, 1, 1, 1, 1),
 (277, 'Error amet tempore nulla', 0, 0, 10, 1, 1, 1, 1),
 (278, 'Deserunt a', 0, 0, 10, 1, 1, 1, 1),
 (279, 'Aperiam sit', 0, 0, 10, 1, 1, 1, 1),
 (280, 'Asperi', 0, 0, 10, 1, 1, 1, 1),
 (281, 'Similique aperiam earum expli', 0, 0, 10, 1, 1, 1, 1),
 (282, 'Iure h', 0, 0, 10, 1, 1, 1, 1),
 (283, 'At sint ducimus nostrum i', 0, 0, 10, 1, 1, 1, 1),
 (284, 'Reprehenderit temporib', 0, 0, 10, 1, 1, 1, 1),
 (285, 'Molestiae quaerat maxim', 0, 0, 10, 1, 1, 1, 1),
 (286, 'Maior', 0, 0, 10, 1, 1, 1, 1),
 (287, 'Unde natus ut ipsa cupi', 0, 0, 10, 1, 1, 1, 1),
 (288, 'Praesentium atque ear', 0, 0, 10, 1, 1, 1, 1),
 (289, 'Rem minima', 0, 0, 10, 1, 1, 1, 1),
 (290, 'Provident sed soluta, sed si', 0, 0, 10, 1, 1, 1, 1),
 (291, 'Natus quia veritatis', 0, 0, 10, 1, 1, 1, 1),
 (292, 'Vero a', 0, 0, 10, 1, 1, 1, 1),
 (293, 'Optio harum labori', 0, 0, 10, 1, 1, 1, 1),
 (294, 'Duci', 0, 0, 10, 1, 1, 1, 1),
 (295, 'Ipsa elige', 0, 0, 10, 1, 1, 1, 1),
 (296, 'Sunt blanditiis i', 0, 0, 10, 1, 1, 1, 1),
 (297, 'Doloremque', 0, 0, 10, 1, 1, 1, 1),
 (298, 'Autem ratione vitae quos, do', 0, 0, 10, 1, 1, 1, 1),
 (299, 'Voluptatibus aliquid', 0, 0, 10, 1, 1, 1, 1),
 (300, 'Quaerat sequi sit eius corpori', 0, 0, 10, 1, 1, 1, 1),
 (301, 'Libe', 0, 0, 10, 1, 1, 1, 1),
 (302, 'Aliquam n', 0, 0, 10, 1, 1, 1, 1)]

In [9]:
# Get table metadata
sl_curs.execute('PRAGMA table_info(charactercreator_character);').fetchall()

[(0, 'character_id', 'integer', 1, None, 1),
 (1, 'name', 'varchar(30)', 1, None, 0),
 (2, 'level', 'integer', 1, None, 0),
 (3, 'exp', 'integer', 1, None, 0),
 (4, 'hp', 'integer', 1, None, 0),
 (5, 'strength', 'integer', 1, None, 0),
 (6, 'intelligence', 'integer', 1, None, 0),
 (7, 'dexterity', 'integer', 1, None, 0),
 (8, 'wisdom', 'integer', 1, None, 0)]

In [10]:
# create matching schema for postgres db
create_character_table = """
    CREATE TABLE charactercreator_character (
      character_id SERIAL PRIMARY KEY,
      name VARCHAR(30),
      level INT,
      exp INT,
      hp INT,
      strength INT,
      intelligence INT,
      dexterity INT,
      wisdom INT
    );
"""

In [11]:
pg_curs.execute(create_character_table)

In [12]:
# Now we can look at what tables are here
show_tables = """
SELECT 
 *
FROM
   pg_catalog.pg_tables
WHERE
    schemaname != 'pg_catalog'
AND schemaname != 'information_schema';
"""
pg_curs.execute(show_tables)
pg_curs.fetchall()

[('public',
  'charactercreator_character',
  'cwmypbdz',
  None,
  True,
  False,
  False,
  False)]

In [13]:
# Test grabbing a single row of values
str(characters[0][1:])

"('Aliquid iste optio reiciendi', 0, 0, 10, 1, 1, 1, 1)"

In [14]:
# code for inserting row into table
insert = """
INSERT INTO charactercreator_character
(name, level, exp, hp, strength, intelligence, dexterity, wisdom)
VALUES """

In [15]:
# insert it all into new table
for character in characters:
    insert_character = insert + str(character[1:]) + ';'
    pg_curs.execute(insert_character)

In [17]:
# Look inside and find all the data
pg_curs.execute('SELECT * FROM charactercreator_character')
pg_curs.fetchall()

[(1, 'Aliquid iste optio reiciendi', 0, 0, 10, 1, 1, 1, 1),
 (2, 'Optio dolorem ex a', 0, 0, 10, 1, 1, 1, 1),
 (3, 'Minus c', 0, 0, 10, 1, 1, 1, 1),
 (4, 'Sit ut repr', 0, 0, 10, 1, 1, 1, 1),
 (5, 'At id recusandae expl', 0, 0, 10, 1, 1, 1, 1),
 (6, 'Non nobis et of', 0, 0, 10, 1, 1, 1, 1),
 (7, 'Perferendis', 0, 0, 10, 1, 1, 1, 1),
 (8, 'Accusantium amet quidem eve', 0, 0, 10, 1, 1, 1, 1),
 (9, 'Sed nostrum inventore error m', 0, 0, 10, 1, 1, 1, 1),
 (10, 'Harum repellendus omnis od', 0, 0, 10, 1, 1, 1, 1),
 (11, 'Itaque ut commodi,', 0, 0, 10, 1, 1, 1, 1),
 (12, 'Molestiae quis', 0, 0, 10, 1, 1, 1, 1),
 (13, 'Ali', 0, 0, 10, 1, 1, 1, 1),
 (14, 'Tempora quod optio possimus il', 0, 0, 10, 1, 1, 1, 1),
 (15, 'Sed itaque beatae pari', 0, 0, 10, 1, 1, 1, 1),
 (16, 'Quam dolor', 0, 0, 10, 1, 1, 1, 1),
 (17, 'Molestias expedita', 0, 0, 10, 1, 1, 1, 1),
 (18, 'Lauda', 0, 0, 10, 1, 1, 1, 1),
 (19, 'Incidunt sint perferen', 0, 0, 10, 1, 1, 1, 1),
 (20, 'Laboriosa', 0, 0, 10, 1, 1, 1, 1),
 (21, 'Dolore esse nesciunt fugit com', 0, 0, 10, 1, 1, 1, 1),
 (22, 'Dolorum nam reic', 0, 0, 10, 1, 1, 1, 1),
 (23, 'Repellat ad numquam volu', 0, 0, 10, 1, 1, 1, 1),
 (24, 'Facere enim velit eligend', 0, 0, 10, 1, 1, 1, 1),
 (25, 'Sed ratione quis rep', 0, 0, 10, 1, 1, 1, 1),
 (26, 'Doloribus neque', 0, 0, 10, 1, 1, 1, 1),
 (27, 'Ab voluptas se', 0, 0, 10, 1, 1, 1, 1),
 (28, 'Molestias m', 0, 0, 10, 1, 1, 1, 1),
 (29, 'In pariatur corpori', 0, 0, 10, 1, 1, 1, 1),
 (30, 'Possimus ad dignissimos vel, a', 0, 0, 10, 1, 1, 1, 1),
 (31, 'At minus accusa', 0, 0, 10, 1, 1, 1, 1),
 (32, 'Ad necess', 0, 0, 10, 1, 1, 1, 1),
 (33, 'Expedita c', 0, 0, 10, 1, 1, 1, 1),
 (34, 'Voluptates sunt voluptas volu', 0, 0, 10, 1, 1, 1, 1),
 (35, 'Autem mollitia fuga lauda', 0, 0, 10, 1, 1, 1, 1),
 (36, 'Sint quibusdam ob', 0, 0, 10, 1, 1, 1, 1),
 (37, 'Rerum et o', 0, 0, 10, 1, 1, 1, 1),
 (38, 'Doloribus dolore r', 0, 0, 10, 1, 1, 1, 1),
 (39, 'Eaque su', 0, 0, 10, 1, 1, 1, 1),
 (40, 'Vel molestias numqua', 0, 0, 10, 1, 1, 1, 1),
 (41, 'Iste assumenda repellat q', 0, 0, 10, 1, 1, 1, 1),
 (42, 'Animi labo', 0, 0, 10, 1, 1, 1, 1),
 (43, 'Eum culpa eaque ea omn', 0, 0, 10, 1, 1, 1, 1),
 (44, 'Harum provident vel quam', 0, 0, 10, 1, 1, 1, 1),
 (45, 'Aspe', 0, 0, 10, 1, 1, 1, 1),
 (46, 'Nisi nequ', 0, 0, 10, 1, 1, 1, 1),
 (47, 'Quod tempora', 0, 0, 10, 1, 1, 1, 1),
 (48, 'Porro aliq', 0, 0, 10, 1, 1, 1, 1),
 (49, 'Quas', 0, 0, 10, 1, 1, 1, 1),
 (50, 'Magnam eligendi quia animi', 0, 0, 10, 1, 1, 1, 1),
 (51, 'Officiis se', 0, 0, 10, 1, 1, 1, 1),
 (52, 'Id assumend', 0, 0, 10, 1, 1, 1, 1),
 (53, 'Voluptatibus fu', 0, 0, 10, 1, 1, 1, 1),
 (54, 'Odit rat', 0, 0, 10, 1, 1, 1, 1),
 (55, 'Debit', 0, 0, 10, 1, 1, 1, 1),
 (56, 'Cum aut quas repudia', 0, 0, 10, 1, 1, 1, 1),
 (57, 'Deleniti qui quae quidem', 0, 0, 10, 1, 1, 1, 1),
 (58, 'Adipisci voluptas', 0, 0, 10, 1, 1, 1, 1),
 (59, 'Debitis sit ratione eos nam', 0, 0, 10, 1, 1, 1, 1),
 (60, 'Esse illo molestias archi', 0, 0, 10, 1, 1, 1, 1),
 (61, 'Sunt at itaque voluptatum d', 0, 0, 10, 1, 1, 1, 1),
 (62, 'Est totam', 0, 0, 10, 1, 1, 1, 1),
 (63, 'Reprehenderit commodi eius', 0, 0, 10, 1, 1, 1, 1),
 (64, 'Debit', 0, 0, 10, 1, 1, 1, 1),
 (65, 'Soluta dol', 0, 0, 10, 1, 1, 1, 1),
 (66, 'Vel nesc', 0, 0, 10, 1, 1, 1, 1),
 (67, 'Ratione quia ali', 0, 0, 10, 1, 1, 1, 1),
 (68, 'Rerum recusandae minima', 0, 0, 10, 1, 1, 1, 1),
 (69, 'Totam natus eius fugiat volu', 0, 0, 10, 1, 1, 1, 1),
 (70, 'Perferendis commodi null', 0, 0, 10, 1, 1, 1, 1),
 (71, 'Laudantiu', 0, 0, 10, 1, 1, 1, 1),
 (72, 'Voluptat', 0, 0, 10, 1, 1, 1, 1),
 (73, 'Incidunt nesciun', 0, 0, 10, 1, 1, 1, 1),
 (74, 'Illum amet vero', 0, 0, 10, 1, 1, 1, 1),
 (75, 'Suscipit exercitationem re', 0, 0, 10, 1, 1, 1, 1),
 (76, 'Quas enim error maxime nisi m', 0, 0, 10, 1, 1, 1, 1),
 (77, 'Labore qu', 0, 0, 10, 1, 1, 1, 1),
 (78, 'Repudiandae deleniti unde', 0, 0, 10, 1, 1, 1, 1),
 (79, 'Ut do', 0, 0, 10, 1, 1, 1, 1),
 (80, 'Quaerat esse labore q', 0, 0, 10, 1, 1, 1, 1),
 (81, 'Quidem aliq', 0, 0, 10, 1, 1, 1, 1),
 (82, 'Aperiam vitae eos dolor sed', 0, 0, 10, 1, 1, 1, 1),
 (83, 'Minus nobis porro', 0, 0, 10, 1, 1, 1, 1),
 (84, 'In similique', 0, 0, 10, 1, 1, 1, 1),
 (85, 'Culpa repellat unde', 0, 0, 10, 1, 1, 1, 1),
 (86, 'Architecto i', 0, 0, 10, 1, 1, 1, 1),
 (87, 'A sed pariatur qua', 0, 0, 10, 1, 1, 1, 1),
 (88, 'Tempore assumenda aperiam', 0, 0, 10, 1, 1, 1, 1),
 (89, 'Sed ullam tempora iusto co', 0, 0, 10, 1, 1, 1, 1),
 (90, 'Ipsa', 0, 0, 10, 1, 1, 1, 1),
 (91, 'Fugiat incidun', 0, 0, 10, 1, 1, 1, 1),
 (92, 'Molestiae of', 0, 0, 10, 1, 1, 1, 1),
 (93, 'Quae quisquam cons', 0, 0, 10, 1, 1, 1, 1),
 (94, 'Repellendus ea non facil', 0, 0, 10, 1, 1, 1, 1),
 (95, 'Quod non quibu', 0, 0, 10, 1, 1, 1, 1),
 (96, 'Numquam velit distinctio', 0, 0, 10, 1, 1, 1, 1),
 (97, 'Necessitatibus nihil ex debi', 0, 0, 10, 1, 1, 1, 1),
 (98, 'Velit tempore nemo, na', 0, 0, 10, 1, 1, 1, 1),
 (99, 'Nesciunt v', 0, 0, 10, 1, 1, 1, 1),
 (100, 'Dicta enim debitis accusantiu', 0, 0, 10, 1, 1, 1, 1),
 (101, 'Vitae a', 0, 0, 10, 1, 1, 1, 1),
 (102, 'Praesentium voluptas u', 0, 0, 10, 1, 1, 1, 1),
 (103, 'Unde ullam mollitia? Nu', 0, 0, 10, 1, 1, 1, 1),
 (104, 'Neque molestias qu', 0, 0, 10, 1, 1, 1, 1),
 (105, 'Officiis es', 0, 0, 10, 1, 1, 1, 1),
 (106, 'Beatae mi', 0, 0, 10, 1, 1, 1, 1),
 (107, 'Mollitia nam corporis temp', 0, 0, 10, 1, 1, 1, 1),
 (108, 'Repudiandae repellat i', 0, 0, 10, 1, 1, 1, 1),
 (109, 'Laboriosam', 0, 0, 10, 1, 1, 1, 1),
 (110, 'Nam minus amet', 0, 0, 10, 1, 1, 1, 1),
 (111, 'Harum quae volup', 0, 0, 10, 1, 1, 1, 1),
 (112, 'Impedit facere ulla', 0, 0, 10, 1, 1, 1, 1),
 (113, 'Enim', 0, 0, 10, 1, 1, 1, 1),
 (114, 'Dolore magni', 0, 0, 10, 1, 1, 1, 1),
 (115, 'Eaque at corpori', 0, 0, 10, 1, 1, 1, 1),
 (116, 'Fug', 0, 0, 10, 1, 1, 1, 1),
 (117, 'Dolorum laudanti', 0, 0, 10, 1, 1, 1, 1),
 (118, 'Perferendis nat', 0, 0, 10, 1, 1, 1, 1),
 (119, 'Cupidi', 0, 0, 10, 1, 1, 1, 1),
 (120, 'Commodi eius dicta digniss', 0, 0, 10, 1, 1, 1, 1),
 (121, 'Debitis eu', 0, 0, 10, 1, 1, 1, 1),
 (122, 'Nihil repella', 0, 0, 10, 1, 1, 1, 1),
 (123, 'Rem quasi minima hic sed anim', 0, 0, 10, 1, 1, 1, 1),
 (124, 'Sed ali', 0, 0, 10, 1, 1, 1, 1),
 (125, 'Earum vol', 0, 0, 10, 1, 1, 1, 1),
 (126, 'Inventore tempore com', 0, 0, 10, 1, 1, 1, 1),
 (127, 'Repell', 0, 0, 10, 1, 1, 1, 1),
 (128, 'Consequatur quis recusandae qu', 0, 0, 10, 1, 1, 1, 1),
 (129, 'Dolores ea velit mi', 0, 0, 10, 1, 1, 1, 1),
 (130, 'Atque blanditiis a aperiam', 0, 0, 10, 1, 1, 1, 1),
 (131, 'Reprehenderit sequi iu', 0, 0, 10, 1, 1, 1, 1),
 (132, 'Natus architecto eos, hic blan', 0, 0, 10, 1, 1, 1, 1),
 (133, 'Ipsa illo quas', 0, 0, 10, 1, 1, 1, 1),
 (134, 'Voluptas ali', 0, 0, 10, 1, 1, 1, 1),
 (135, 'Voluptates obcaecati quod e', 0, 0, 10, 1, 1, 1, 1),
 (136, 'Dolor adipisci a voluptate', 0, 0, 10, 1, 1, 1, 1),
 (137, 'Repellendus natus quae, n', 0, 0, 10, 1, 1, 1, 1),
 (138, 'Laudantium earum nam in dol', 0, 0, 10, 1, 1, 1, 1),
 (139, 'Molestias face', 0, 0, 10, 1, 1, 1, 1),
 (140, 'Maiores suscipit exc', 0, 0, 10, 1, 1, 1, 1),
 (141, 'Illum dolore perferen', 0, 0, 10, 1, 1, 1, 1),
 (142, 'Explicabo recusandae ma', 0, 0, 10, 1, 1, 1, 1),
 (143, 'Odio obcaecati hic nostrum n', 0, 0, 10, 1, 1, 1, 1),
 (144, 'Voluptate ali', 0, 0, 10, 1, 1, 1, 1),
 (145, 'Repudiandae vitae sapiente mol', 0, 0, 10, 1, 1, 1, 1),
 (146, 'Ipsam cumque', 0, 0, 10, 1, 1, 1, 1),
 (147, 'Fugiat quos alias eos dese', 0, 0, 10, 1, 1, 1, 1),
 (148, 'Eaque impe', 0, 0, 10, 1, 1, 1, 1),
 (149, 'Elige', 0, 0, 10, 1, 1, 1, 1),
 (150, 'Adip', 0, 0, 10, 1, 1, 1, 1),
 (151, 'Fuga nemo vel mo', 0, 0, 10, 1, 1, 1, 1),
 (152, 'Libero cumque impedit eveniet', 0, 0, 10, 1, 1, 1, 1),
 (153, 'Odio soluta', 0, 0, 10, 1, 1, 1, 1),
 (154, 'Vero nostrum duc', 0, 0, 10, 1, 1, 1, 1),
 (155, 'Repellend', 0, 0, 10, 1, 1, 1, 1),
 (156, 'Quod', 0, 0, 10, 1, 1, 1, 1),
 (157, 'Suscipit reiciend', 0, 0, 10, 1, 1, 1, 1),
 (158, 'Voluptat', 0, 0, 10, 1, 1, 1, 1),
 (159, 'Porro dolor fuga quam', 0, 0, 10, 1, 1, 1, 1),
 (160, 'Amet quo fugit aliquam sequi', 0, 0, 10, 1, 1, 1, 1),
 (161, 'Magni adipisci veritatis sit q', 0, 0, 10, 1, 1, 1, 1),
 (162, 'Debitis enim cumque cum qu', 0, 0, 10, 1, 1, 1, 1),
 (163, 'Dolorem eligend', 0, 0, 10, 1, 1, 1, 1),
 (164, 'Autem lib', 0, 0, 10, 1, 1, 1, 1),
 (165, 'Saepe assumenda perferendis f', 0, 0, 10, 1, 1, 1, 1),
 (166, 'Deserunt', 0, 0, 10, 1, 1, 1, 1),
 (167, 'Provident soluta simil', 0, 0, 10, 1, 1, 1, 1),
 (168, 'In accu', 0, 0, 10, 1, 1, 1, 1),
 (169, 'Inve', 0, 0, 10, 1, 1, 1, 1),
 (170, 'Placeat sapiente', 0, 0, 10, 1, 1, 1, 1),
 (171, 'Ducimus architecto ullam', 0, 0, 10, 1, 1, 1, 1),
 (172, 'Voluptate tempora rerum', 0, 0, 10, 1, 1, 1, 1),
 (173, 'Totam incidunt earum perspicia', 0, 0, 10, 1, 1, 1, 1),
 (174, 'Optio quas e', 0, 0, 10, 1, 1, 1, 1),
 (175, 'Ab illum invento', 0, 0, 10, 1, 1, 1, 1),
 (176, 'Repellat quis natus totam, s', 0, 0, 10, 1, 1, 1, 1),
 (177, 'Est voluptate accusantium tem', 0, 0, 10, 1, 1, 1, 1),
 (178, 'Beatae q', 0, 0, 10, 1, 1, 1, 1),
 (179, 'Velit', 0, 0, 10, 1, 1, 1, 1),
 (180, 'Minus nequ', 0, 0, 10, 1, 1, 1, 1),
 (181, 'Autem eos voluptates off', 0, 0, 10, 1, 1, 1, 1),
 (182, 'Vel fug', 0, 0, 10, 1, 1, 1, 1),
 (183, 'Architecto repudian', 0, 0, 10, 1, 1, 1, 1),
 (184, 'Opti', 0, 0, 10, 1, 1, 1, 1),
 (185, 'Iust', 0, 0, 10, 1, 1, 1, 1),
 (186, 'Sapiente', 0, 0, 10, 1, 1, 1, 1),
 (187, 'Officiis repellat corrupti su', 0, 0, 10, 1, 1, 1, 1),
 (188, 'Dicta et natus e', 0, 0, 10, 1, 1, 1, 1),
 (189, 'At quos', 0, 0, 10, 1, 1, 1, 1),
 (190, 'Laborum ven', 0, 0, 10, 1, 1, 1, 1),
 (191, 'Exceptur', 0, 0, 10, 1, 1, 1, 1),
 (192, 'Reiciendis assumenda dolo', 0, 0, 10, 1, 1, 1, 1),
 (193, 'Poss', 0, 0, 10, 1, 1, 1, 1),
 (194, 'Acc', 0, 0, 10, 1, 1, 1, 1),
 (195, 'Placeat esse archit', 0, 0, 10, 1, 1, 1, 1),
 (196, 'Enim repellendus nihil est te', 0, 0, 10, 1, 1, 1, 1),
 (197, 'Ipsam incidunt t', 0, 0, 10, 1, 1, 1, 1),
 (198, 'Iure', 0, 0, 10, 1, 1, 1, 1),
 (199, 'Illo en', 0, 0, 10, 1, 1, 1, 1),
 (200, 'A rem ex', 0, 0, 10, 1, 1, 1, 1),
 (201, 'Officiis su', 0, 0, 10, 1, 1, 1, 1),
 (202, 'Numquam molestias', 0, 0, 10, 1, 1, 1, 1),
 (203, 'Voluptates unde', 0, 0, 10, 1, 1, 1, 1),
 (204, 'Quae praesentium vel', 0, 0, 10, 1, 1, 1, 1),
 (205, 'Quas', 0, 0, 10, 1, 1, 1, 1),
 (206, 'Dolores aliquid inv', 0, 0, 10, 1, 1, 1, 1),
 (207, 'Mollitia tempore laborum eaqu', 0, 0, 10, 1, 1, 1, 1),
 (208, 'Nobis voluptates fugiat quia', 0, 0, 10, 1, 1, 1, 1),
 (209, 'Similique dolorem dolore maio', 0, 0, 10, 1, 1, 1, 1),
 (210, 'Sapiente', 0, 0, 10, 1, 1, 1, 1),
 (211, 'Officia nisi dolore', 0, 0, 10, 1, 1, 1, 1),
 (212, 'Distinctio', 0, 0, 10, 1, 1, 1, 1),
 (213, 'Eos quia dignissimos saepe vel', 0, 0, 10, 1, 1, 1, 1),
 (214, 'Ullam neque sint eligendi', 0, 0, 10, 1, 1, 1, 1),
 (215, 'Excepturi deleniti ab a', 0, 0, 10, 1, 1, 1, 1),
 (216, 'Accusa', 0, 0, 10, 1, 1, 1, 1),
 (217, 'Reiciendis laboriosam di', 0, 0, 10, 1, 1, 1, 1),
 (218, 'Delectus ex', 0, 0, 10, 1, 1, 1, 1),
 (219, 'Pari', 0, 0, 10, 1, 1, 1, 1),
 (220, 'Veritatis velit facilis iste', 0, 0, 10, 1, 1, 1, 1),
 (221, 'Dol', 0, 0, 10, 1, 1, 1, 1),
 (222, 'Qui iste pr', 0, 0, 10, 1, 1, 1, 1),
 (223, 'Deleni', 0, 0, 10, 1, 1, 1, 1),
 (224, 'Reprehenderit volu', 0, 0, 10, 1, 1, 1, 1),
 (225, 'Accusantium vitae n', 0, 0, 10, 1, 1, 1, 1),
 (226, 'Natus consequatur incidun', 0, 0, 10, 1, 1, 1, 1),
 (227, 'Dignissimos a', 0, 0, 10, 1, 1, 1, 1),
 (228, 'Vitae modi', 0, 0, 10, 1, 1, 1, 1),
 (229, 'Accusantium qu', 0, 0, 10, 1, 1, 1, 1),
 (230, 'Reiciendis dignissimos ratio', 0, 0, 10, 1, 1, 1, 1),
 (231, 'Expedita provident natus volup', 0, 0, 10, 1, 1, 1, 1),
 (232, 'Rerum repellat voluptas c', 0, 0, 10, 1, 1, 1, 1),
 (233, 'Maiores quos incidunt dolor', 0, 0, 10, 1, 1, 1, 1),
 (234, 'Aper', 0, 0, 10, 1, 1, 1, 1),
 (235, 'Nulla', 0, 0, 10, 1, 1, 1, 1),
 (236, 'Laudantium tempora itaque', 0, 0, 10, 1, 1, 1, 1),
 (237, 'Reprehenderit', 0, 0, 10, 1, 1, 1, 1),
 (238, 'Aliqu', 0, 0, 10, 1, 1, 1, 1),
 (239, 'Odio harum nam mole', 0, 0, 10, 1, 1, 1, 1),
 (240, 'Arc', 0, 0, 10, 1, 1, 1, 1),
 (241, 'Reprehenderit li', 0, 0, 10, 1, 1, 1, 1),
 (242, 'Repr', 0, 0, 10, 1, 1, 1, 1),
 (243, 'Optio m', 0, 0, 10, 1, 1, 1, 1),
 (244, 'Esse odit amet rep', 0, 0, 10, 1, 1, 1, 1),
 (245, 'Provident nostrum minima', 0, 0, 10, 1, 1, 1, 1),
 (246, 'Ex nihil quae facilis a omni', 0, 0, 10, 1, 1, 1, 1),
 (247, 'Dolorem quaerat sunt', 0, 0, 10, 1, 1, 1, 1),
 (248, 'Distinctio', 0, 0, 10, 1, 1, 1, 1),
 (249, 'Repudiandae ip', 0, 0, 10, 1, 1, 1, 1),
 (250, 'Iste debitis dolorum amet m', 0, 0, 10, 1, 1, 1, 1),
 (251, 'Non qui vo', 0, 0, 10, 1, 1, 1, 1),
 (252, 'Dolorem ma', 0, 0, 10, 1, 1, 1, 1),
 (253, 'Molestias labore tempore ita', 0, 0, 10, 1, 1, 1, 1),
 (254, 'Vol', 0, 0, 10, 1, 1, 1, 1),
 (255, 'Adipisci molest', 0, 0, 10, 1, 1, 1, 1),
 (256, 'Omni', 0, 0, 10, 1, 1, 1, 1),
 (257, 'Voluptatibus dolor', 0, 0, 10, 1, 1, 1, 1),
 (258, 'Quo', 0, 0, 10, 1, 1, 1, 1),
 (259, 'Atque aspernatur possi', 0, 0, 10, 1, 1, 1, 1),
 (260, 'Ullam c', 0, 0, 10, 1, 1, 1, 1),
 (261, 'Iusto quas voluptatibu', 0, 0, 10, 1, 1, 1, 1),
 (262, 'Optio qui sunt dolores, ab', 0, 0, 10, 1, 1, 1, 1),
 (263, 'Illum recusandae nulla re', 0, 0, 10, 1, 1, 1, 1),
 (264, 'Verita', 0, 0, 10, 1, 1, 1, 1),
 (265, 'Expedita quod blanditiis', 0, 0, 10, 1, 1, 1, 1),
 (266, 'Mag', 0, 0, 10, 1, 1, 1, 1),
 (267, 'Omnis quos aspernatur d', 0, 0, 10, 1, 1, 1, 1),
 (268, 'Sunt impedit co', 0, 0, 10, 1, 1, 1, 1),
 (269, 'Minima quam ea ad', 0, 0, 10, 1, 1, 1, 1),
 (270, 'Suscipit quidem e', 0, 0, 10, 1, 1, 1, 1),
 (271, 'Harum', 0, 0, 10, 1, 1, 1, 1),
 (272, 'Dolore laborum ips', 0, 0, 10, 1, 1, 1, 1),
 (273, 'Magni veniam earum corporis', 0, 0, 10, 1, 1, 1, 1),
 (274, 'Optio', 0, 0, 10, 1, 1, 1, 1),
 (275, 'Nam fugit vel.', 0, 0, 10, 1, 1, 1, 1),
 (276, 'Ut numquam quam eum, alias ius', 0, 0, 10, 1, 1, 1, 1),
 (277, 'Error amet tempore nulla', 0, 0, 10, 1, 1, 1, 1),
 (278, 'Deserunt a', 0, 0, 10, 1, 1, 1, 1),
 (279, 'Aperiam sit', 0, 0, 10, 1, 1, 1, 1),
 (280, 'Asperi', 0, 0, 10, 1, 1, 1, 1),
 (281, 'Similique aperiam earum expli', 0, 0, 10, 1, 1, 1, 1),
 (282, 'Iure h', 0, 0, 10, 1, 1, 1, 1),
 (283, 'At sint ducimus nostrum i', 0, 0, 10, 1, 1, 1, 1),
 (284, 'Reprehenderit temporib', 0, 0, 10, 1, 1, 1, 1),
 (285, 'Molestiae quaerat maxim', 0, 0, 10, 1, 1, 1, 1),
 (286, 'Maior', 0, 0, 10, 1, 1, 1, 1),
 (287, 'Unde natus ut ipsa cupi', 0, 0, 10, 1, 1, 1, 1),
 (288, 'Praesentium atque ear', 0, 0, 10, 1, 1, 1, 1),
 (289, 'Rem minima', 0, 0, 10, 1, 1, 1, 1),
 (290, 'Provident sed soluta, sed si', 0, 0, 10, 1, 1, 1, 1),
 (291, 'Natus quia veritatis', 0, 0, 10, 1, 1, 1, 1),
 (292, 'Vero a', 0, 0, 10, 1, 1, 1, 1),
 (293, 'Optio harum labori', 0, 0, 10, 1, 1, 1, 1),
 (294, 'Duci', 0, 0, 10, 1, 1, 1, 1),
 (295, 'Ipsa elige', 0, 0, 10, 1, 1, 1, 1),
 (296, 'Sunt blanditiis i', 0, 0, 10, 1, 1, 1, 1),
 (297, 'Doloremque', 0, 0, 10, 1, 1, 1, 1),
 (298, 'Autem ratione vitae quos, do', 0, 0, 10, 1, 1, 1, 1),
 (299, 'Voluptatibus aliquid', 0, 0, 10, 1, 1, 1, 1),
 (300, 'Quaerat sequi sit eius corpori', 0, 0, 10, 1, 1, 1, 1),
 (301, 'Libe', 0, 0, 10, 1, 1, 1, 1),
 (302, 'Aliquam n', 0, 0, 10, 1, 1, 1, 1)]

In [18]:
# get a list of the data from postgres
pg_curs.execute('SELECT * FROM charactercreator_character;')
pg_characters = pg_curs.fetchall()

In [19]:
# Close connection and commit to secure changes
pg_curs.close()
pg_conn.commit()

In [21]:
# Test that data is the same 
for character, pg_character in zip(characters, pg_characters):
    assert character == pg_character

## New Section

### Titanic

In [4]:
import pandas as pd

In [5]:
df = pd.read_csv('titanic.csv')
df.head()

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500

In [6]:
df.columns = ['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'Siblings_Spouses_Aboard',
              'Parents_Children_Aboard', 'Fare']
df['Name'] = df['Name'].str.replace("'", "")
df.head()

,Survived,Pclass,Name,Sex,Age,Siblings_Spouses_Aboard,Parents_Children_Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500

In [7]:
sl_conn = sqlite3.connect('titanic_table')

In [8]:

df.to_sql('titanic_table', con=sl_conn, if_exists='replace')

In [9]:
sl_curs = sl_conn.cursor()
sl_curs.execute('PRAGMA table_info(titanic_table)').fetchall()

[(0, 'index', 'INTEGER', 0, None, 0),
 (1, 'Survived', 'INTEGER', 0, None, 0),
 (2, 'Pclass', 'INTEGER', 0, None, 0),
 (3, 'Name', 'TEXT', 0, None, 0),
 (4, 'Sex', 'TEXT', 0, None, 0),
 (5, 'Age', 'REAL', 0, None, 0),
 (6, 'Siblings_Spouses_Aboard', 'INTEGER', 0, None, 0),
 (7, 'Parents_Children_Aboard', 'INTEGER', 0, None, 0),
 (8, 'Fare', 'REAL', 0, None, 0)]

In [10]:
create_titanic_table = """
  CREATE TABLE titanic_table (
    Survived INT,
    Pclass INT,
    Name TEXT,
    Sex TEXT,
    Age REAL,
    Siblings_Spouses_Aboard INT,
    Parents_Children_Aboard INT,
    Fare REAL
  );
"""

In [11]:
pg_curs.execute(create_titanic_table)

In [12]:
pg_curs.execute('SELECT * FROM titanic_table')
pg_curs.fetchall()

[]

In [13]:
# get data from titanic table in sqlite
chars = sl_curs.execute('SELECT * FROM titanic_table').fetchall()
chars

[(0, 0, 3, 'Mr. Owen Harris Braund', 'male', 22.0, 1, 0, 7.25),
 (1,
  1,
  1,
  'Mrs. John Bradley (Florence Briggs Thayer) Cumings',
  'female',
  38.0,
  1,
  0,
  71.2833),
 (2, 1, 3, 'Miss. Laina Heikkinen', 'female', 26.0, 0, 0, 7.925),
 (3,
  1,
  1,
  'Mrs. Jacques Heath (Lily May Peel) Futrelle',
  'female',
  35.0,
  1,
  0,
  53.1),
 (4, 0, 3, 'Mr. William Henry Allen', 'male', 35.0, 0, 0, 8.05),
 (5, 0, 3, 'Mr. James Moran', 'male', 27.0, 0, 0, 8.4583),
 (6, 0, 1, 'Mr. Timothy J McCarthy', 'male', 54.0, 0, 0, 51.8625),
 (7, 0, 3, 'Master. Gosta Leonard Palsson', 'male', 2.0, 3, 1, 21.075),
 (8,
  1,
  3,
  'Mrs. Oscar W (Elisabeth Vilhelmina Berg) Johnson',
  'female',
  27.0,
  0,
  2,
  11.1333),
 (9,
  1,
  2,
  'Mrs. Nicholas (Adele Achem) Nasser',
  'female',
  14.0,
  1,
  0,
  30.0708),
 (10, 1, 3, 'Miss. Marguerite Rut Sandstrom', 'female', 4.0, 1, 1, 16.7),
 (11, 1, 1, 'Miss. Elizabeth Bonnell', 'female', 58.0, 0, 0, 26.55),
 (12, 0, 3, 'Mr. William Henry Saundercock', 'male', 20.0, 0, 0, 8.05),
 (13, 0, 3, 'Mr. Anders Johan Andersson', 'male', 39.0, 1, 5, 31.275),
 (14,
  0,
  3,
  'Miss. Hulda Amanda Adolfina Vestrom',
  'female',
  14.0,
  0,
  0,
  7.8542),
 (15, 1, 2, 'Mrs. (Mary D Kingcome) Hewlett', 'female', 55.0, 0, 0, 16.0),
 (16, 0, 3, 'Master. Eugene Rice', 'male', 2.0, 4, 1, 29.125),
 (17, 1, 2, 'Mr. Charles Eugene Williams', 'male', 23.0, 0, 0, 13.0),
 (18,
  0,
  3,
  'Mrs. Julius (Emelia Maria Vandemoortele) Vander Planke',
  'female',
  31.0,
  1,
  0,
  18.0),
 (19, 1, 3, 'Mrs. Fatima Masselmani', 'female', 22.0, 0, 0, 7.225),
 (20, 0, 2, 'Mr. Joseph J Fynney', 'male', 35.0, 0, 0, 26.0),
 (21, 1, 2, 'Mr. Lawrence Beesley', 'male', 34.0, 0, 0, 13.0),
 (22, 1, 3, 'Miss. Anna McGowan', 'female', 15.0, 0, 0, 8.0292),
 (23, 1, 1, 'Mr. William Thompson Sloper', 'male', 28.0, 0, 0, 35.5),
 (24, 0, 3, 'Miss. Torborg Danira Palsson', 'female', 8.0, 3, 1, 21.075),
 (25,
  1,
  3,
  'Mrs. Carl Oscar (Selma Augusta Emilia Johansson) Asplund',
  'female',
  38.0,
  1,
  5,
  31.3875),
 (26, 0, 3, 'Mr. Farred Chehab Emir', 'male', 26.0, 0, 0, 7.225),
 (27, 0, 1, 'Mr. Charles Alexander Fortune', 'male', 19.0, 3, 2, 263.0),
 (28, 1, 3, 'Miss. Ellen ODwyer', 'female', 24.0, 0, 0, 7.8792),
 (29, 0, 3, 'Mr. Lalio Todoroff', 'male', 23.0, 0, 0, 7.8958),
 (30, 0, 1, 'Don. Manuel E Uruchurtu', 'male', 40.0, 0, 0, 27.7208),
 (31,
  1,
  1,
  'Mrs. William Augustus (Marie Eugenie) Spencer',
  'female',
  48.0,
  1,
  0,
  146.5208),
 (32, 1, 3, 'Miss. Mary Agatha Glynn', 'female', 18.0, 0, 0, 7.75),
 (33, 0, 2, 'Mr. Edward H Wheadon', 'male', 66.0, 0, 0, 10.5),
 (34, 0, 1, 'Mr. Edgar Joseph Meyer', 'male', 28.0, 1, 0, 82.1708),
 (35, 0, 1, 'Mr. Alexander Oskar Holverson', 'male', 42.0, 1, 0, 52.0),
 (36, 1, 3, 'Mr. Hanna Mamee', 'male', 18.0, 0, 0, 7.2292),
 (37, 0, 3, 'Mr. Ernest Charles Cann', 'male', 21.0, 0, 0, 8.05),
 (38, 0, 3, 'Miss. Augusta Maria Vander Planke', 'female', 18.0, 2, 0, 18.0),
 (39, 1, 3, 'Miss. Jamila Nicola-Yarred', 'female', 14.0, 1, 0, 11.2417),
 (40,
  0,
  3,
  'Mrs. Johan (Johanna Persdotter Larsson) Ahlin',
  'female',
  40.0,
  1,
  0,
  9.475),
 (41,
  0,
  2,
  'Mrs. William John Robert (Dorothy Ann Wonnacott) Turpin',
  'female',
  27.0,
  1,
  0,
  21.0),
 (42,
  1,
  2,
  'Miss. Simonne Marie Anne Andree Laroche',
  'female',
  3.0,
  1,
  2,
  41.5792),
 (43, 1, 3, 'Miss. Margaret Delia Devaney', 'female', 19.0, 0, 0, 7.8792),
 (44, 0, 3, 'Mr. William John Rogers', 'male', 30.0, 0, 0, 8.05),
 (45, 0, 3, 'Mr. Denis Lennon', 'male', 20.0, 1, 0, 15.5),
 (46, 1, 3, 'Miss. Bridget ODriscoll', 'female', 27.0, 0, 0, 7.75),
 (47, 0, 3, 'Mr. Youssef Samaan', 'male', 16.0, 2, 0, 21.6792),
 (48,
  0,
  3,
  'Mrs. Josef (Josefine Franchi) Arnold-Franchi',
  'female',
  18.0,
  1,
  0,
  17.8),
 (49, 0, 3, 'Master. Juha Niilo Panula', 'male', 7.0, 4, 1, 39.6875),
 (50, 0, 3, 'Mr. Richard Cater Nosworthy', 'male', 21.0, 0, 0, 7.8),
 (51,
  1,
  1,
  'Mrs. Henry Sleeper (Myna Haxtun) Harper',
  'female',
  49.0,
  1,
  0,
  76.7292),
 (52,
  1,
  2,
  'Mrs. Lizzie (Elizabeth Anne Wilkinson) Faunthorpe',
  'female',
  29.0,
  1,
  0,
  26.0),
 (53, 0, 1, 'Mr. Engelhart Cornelius Ostby', 'male', 65.0, 0, 1, 61.9792),
 (54, 1, 1, 'Mr. Hugh Woolner', 'male', 46.0, 0, 0, 35.5),
 (55, 1, 2, 'Miss. Emily Rugg', 'female', 21.0, 0, 0, 10.5),
 (56, 0, 3, 'Mr. Mansouer Novel', 'male', 28.5, 0, 0, 7.2292),
 (57, 1, 2, 'Miss. Constance Mirium West', 'female', 5.0, 1, 2, 27.75),
 (58, 0, 3, 'Master. William Frederick Goodwin', 'male', 11.0, 5, 2, 46.9),
 (59, 0, 3, 'Mr. Orsen Sirayanian', 'male', 22.0, 0, 0, 7.2292),
 (60, 1, 1, 'Miss. Amelie Icard', 'female', 38.0, 0, 0, 80.0),
 (61, 0, 1, 'Mr. Henry Birkhardt Harris', 'male', 45.0, 1, 0, 83.475),
 (62, 0, 3, 'Master. Harald Skoog', 'male', 4.0, 3, 2, 27.9),
 (63, 0, 1, 'Mr. Albert A Stewart', 'male', 64.0, 0, 0, 27.7208),
 (64, 1, 3, 'Master. Gerios Moubarek', 'male', 7.0, 1, 1, 15.2458),
 (65, 1, 2, 'Mrs. (Elizabeth Ramell) Nye', 'female', 29.0, 0, 0, 10.5),
 (66, 0, 3, 'Mr. Ernest James Crease', 'male', 19.0, 0, 0, 8.1583),
 (67, 1, 3, 'Miss. Erna Alexandra Andersson', 'female', 17.0, 4, 2, 7.925),
 (68, 0, 3, 'Mr. Vincenz Kink', 'male', 26.0, 2, 0, 8.6625),
 (69, 0, 2, 'Mr. Stephen Curnow Jenkin', 'male', 32.0, 0, 0, 10.5),
 (70, 0, 3, 'Miss. Lillian Amy Goodwin', 'female', 16.0, 5, 2, 46.9),
 (71, 0, 2, 'Mr. Ambrose Jr Hood', 'male', 21.0, 0, 0, 73.5),
 (72, 0, 3, 'Mr. Apostolos Chronopoulos', 'male', 26.0, 1, 0, 14.4542),
 (73, 1, 3, 'Mr. Lee Bing', 'male', 32.0, 0, 0, 56.4958),
 (74, 0, 3, 'Mr. Sigurd Hansen Moen', 'male', 25.0, 0, 0, 7.65),
 (75, 0, 3, 'Mr. Ivan Staneff', 'male', 23.0, 0, 0, 7.8958),
 (76, 0, 3, 'Mr. Rahamin Haim Moutal', 'male', 28.0, 0, 0, 8.05),
 (77, 1, 2, 'Master. Alden Gates Caldwell', 'male', 0.83, 0, 2, 29.0),
 (78, 1, 3, 'Miss. Elizabeth Dowdell', 'female', 30.0, 0, 0, 12.475),
 (79, 0, 3, 'Mr. Achille Waelens', 'male', 22.0, 0, 0, 9.0),
 (80, 1, 3, 'Mr. Jan Baptist Sheerlinck', 'male', 29.0, 0, 0, 9.5),
 (81, 1, 3, 'Miss. Brigdet Delia McDermott', 'female', 31.0, 0, 0, 7.7875),
 (82, 0, 1, 'Mr. Francisco M Carrau', 'male', 28.0, 0, 0, 47.1),
 (83, 1, 2, 'Miss. Bertha Ilett', 'female', 17.0, 0, 0, 10.5),
 (84,
  1,
  3,
  'Mrs. Karl Alfred (Maria Mathilda Gustafsson) Backstrom',
  'female',
  33.0,
  3,
  0,
  15.85),
 (85, 0, 3, 'Mr. William Neal Ford', 'male', 16.0, 1, 3, 34.375),
 (86, 0, 3, 'Mr. Selman Francis Slocovski', 'male', 20.0, 0, 0, 8.05),
 (87, 1, 1, 'Miss. Mabel Helen Fortune', 'female', 23.0, 3, 2, 263.0),
 (88, 0, 3, 'Mr. Francesco Celotti', 'male', 24.0, 0, 0, 8.05),
 (89, 0, 3, 'Mr. Emil Christmann', 'male', 29.0, 0, 0, 8.05),
 (90, 0, 3, 'Mr. Paul Edvin Andreasson', 'male', 20.0, 0, 0, 7.8542),
 (91, 0, 1, 'Mr. Herbert Fuller Chaffee', 'male', 46.0, 1, 0, 61.175),
 (92, 0, 3, 'Mr. Bertram Frank Dean', 'male', 26.0, 1, 2, 20.575),
 (93, 0, 3, 'Mr. Daniel Coxon', 'male', 59.0, 0, 0, 7.25),
 (94, 0, 3, 'Mr. Charles Joseph Shorney', 'male', 22.0, 0, 0, 8.05),
 (95, 0, 1, 'Mr. George B Goldschmidt', 'male', 71.0, 0, 0, 34.6542),
 (96, 1, 1, 'Mr. William Bertram Greenfield', 'male', 23.0, 0, 1, 63.3583),
 (97, 1, 2, 'Mrs. John T (Ada Julia Bone) Doling', 'female', 34.0, 0, 1, 23.0),
 (98, 0, 2, 'Mr. Sinai Kantor', 'male', 34.0, 1, 0, 26.0),
 (99, 0, 3, 'Miss. Matilda Petranec', 'female', 28.0, 0, 0, 7.8958),
 (100, 0, 3, 'Mr. Pastcho Petroff', 'male', 29.0, 0, 0, 7.8958),
 (101, 0, 1, 'Mr. Richard Frasar White', 'male', 21.0, 0, 1, 77.2875),
 (102, 0, 3, 'Mr. Gustaf Joel Johansson', 'male', 33.0, 0, 0, 8.6542),
 (103, 0, 3, 'Mr. Anders Vilhelm Gustafsson', 'male', 37.0, 2, 0, 7.925),
 (104, 0, 3, 'Mr. Stoytcho Mionoff', 'male', 28.0, 0, 0, 7.8958),
 (105, 1, 3, 'Miss. Anna Kristine Salkjelsvik', 'female', 21.0, 0, 0, 7.65),
 (106, 1, 3, 'Mr. Albert Johan Moss', 'male', 29.0, 0, 0, 7.775),
 (107, 0, 3, 'Mr. Tido Rekic', 'male', 38.0, 0, 0, 7.8958),
 (108, 1, 3, 'Miss. Bertha Moran', 'female', 28.0, 1, 0, 24.15),
 (109, 0, 1, 'Mr. Walter Chamberlain Porter', 'male', 47.0, 0, 0, 52.0),
 (110, 0, 3, 'Miss. Hileni Zabour', 'female', 14.5, 1, 0, 14.4542),
 (111, 0, 3, 'Mr. David John Barton', 'male', 22.0, 0, 0, 8.05),
 (112, 0, 3, 'Miss. Katriina Jussila', 'female', 20.0, 1, 0, 9.825),
 (113, 0, 3, 'Miss. Malake Attalah', 'female', 17.0, 0, 0, 14.4583),
 (114, 0, 3, 'Mr. Edvard Pekoniemi', 'male', 21.0, 0, 0, 7.925),
 (115, 0, 3, 'Mr. Patrick Connors', 'male', 70.5, 0, 0, 7.75),
 (116, 0, 2, 'Mr. William John Robert Turpin', 'male', 29.0, 1, 0, 21.0),
 (117, 0, 1, 'Mr. Quigg Edmond Baxter', 'male', 24.0, 0, 1, 247.5208),
 (118, 0, 3, 'Miss. Ellis Anna Maria Andersson', 'female', 2.0, 4, 2, 31.275),
 (119, 0, 2, 'Mr. Stanley George Hickman', 'male', 21.0, 2, 0, 73.5),
 (120, 0, 3, 'Mr. Leonard Charles Moore', 'male', 19.0, 0, 0, 8.05),
 (121, 0, 2, 'Mr. Nicholas Nasser', 'male', 32.5, 1, 0, 30.0708),
 (122, 1, 2, 'Miss. Susan Webber', 'female', 32.5, 0, 0, 13.0),
 (123, 0, 1, 'Mr. Percival Wayland White', 'male', 54.0, 0, 1, 77.2875),
 (124, 1, 3, 'Master. Elias Nicola-Yarred', 'male', 12.0, 1, 0, 11.2417),
 (125, 0, 3, 'Mr. Martin McMahon', 'male', 19.0, 0, 0, 7.75),
 (126, 1, 3, 'Mr. Fridtjof Arne Madsen', 'male', 24.0, 0, 0, 7.1417),
 (127, 1, 3, 'Miss. Anna Peter', 'female', 2.0, 1, 1, 22.3583),
 (128, 0, 3, 'Mr. Johan Ekstrom', 'male', 45.0, 0, 0, 6.975),
 (129, 0, 3, 'Mr. Jozef Drazenoic', 'male', 33.0, 0, 0, 7.8958),
 (130, 0, 3, 'Mr. Domingos Fernandeo Coelho', 'male', 20.0, 0, 0, 7.05),
 (131,
  0,
  3,
  'Mrs. Alexander A (Grace Charity Laury) Robins',
  'female',
  47.0,
  1,
  0,
  14.5),
 (132,
  1,
  2,
  'Mrs. Leopold (Mathilde Francoise Pede) Weisz',
  'female',
  29.0,
  1,
  0,
  26.0),
 (133, 0, 2, 'Mr. Samuel James Hayden Sobey', 'male', 25.0, 0, 0, 13.0),
 (134, 0, 2, 'Mr. Emile Richard', 'male', 23.0, 0, 0, 15.0458),
 (135, 1, 1, 'Miss. Helen Monypeny Newsom', 'female', 19.0, 0, 2, 26.2833),
 (136, 0, 1, 'Mr. Jacques Heath Futrelle', 'male', 37.0, 1, 0, 53.1),
 (137, 0, 3, 'Mr. Olaf Elon Osen', 'male', 16.0, 0, 0, 9.2167),
 (138, 0, 1, 'Mr. Victor Giglio', 'male', 24.0, 0, 0, 79.2),
 (139, 0, 3, 'Mrs. Joseph (Sultana) Boulos', 'female', 40.0, 0, 2, 15.2458),
 (140, 1, 3, 'Miss. Anna Sofia Nysten', 'female', 22.0, 0, 0, 7.75),
 (141,
  1,
  3,
  'Mrs. Pekka Pietari (Elin Matilda Dolck) Hakkarainen',
  'female',
  24.0,
  1,
  0,
  15.85),
 (142, 0, 3, 'Mr. Jeremiah Burke', 'male', 19.0, 0, 0, 6.75),
 (143, 0, 2, 'Mr. Edgardo Samuel Andrew', 'male', 18.0, 0, 0, 11.5),
 (144, 0, 2, 'Mr. Joseph Charles Nicholls', 'male', 19.0, 1, 1, 36.75),
 (145, 1, 3, 'Mr. August Edvard Andersson', 'male', 27.0, 0, 0, 7.7958),
 (146, 0, 3, 'Miss. Robina Maggie Ford', 'female', 9.0, 2, 2, 34.375),
 (147, 0, 2, 'Mr. Michel Navratil', 'male', 36.5, 0, 2, 26.0),
 (148, 0, 2, 'Rev. Thomas Roussel Davids Byles', 'male', 42.0, 0, 0, 13.0),
 (149, 0, 2, 'Rev. Robert James Bateman', 'male', 51.0, 0, 0, 12.525),
 (150, 1, 1, 'Mrs. Thomas (Edith Wearne) Pears', 'female', 22.0, 1, 0, 66.6),
 (151, 0, 3, 'Mr. Alfonzo Meo', 'male', 55.5, 0, 0, 8.05),
 (152, 0, 3, 'Mr. Austin Blyler van Billiard', 'male', 40.5, 0, 2, 14.5),
 (153, 0, 3, 'Mr. Ole Martin Olsen', 'male', 27.0, 0, 0, 7.3125),
 (154, 0, 1, 'Mr. Charles Duane Williams', 'male', 51.0, 0, 1, 61.3792),
 (155, 1, 3, 'Miss. Katherine Gilnagh', 'female', 16.0, 0, 0, 7.7333),
 (156, 0, 3, 'Mr. Harry Corn', 'male', 30.0, 0, 0, 8.05),
 (157, 0, 3, 'Mr. Mile Smiljanic', 'male', 37.0, 0, 0, 8.6625),
 (158, 0, 3, 'Master. Thomas Henry Sage', 'male', 5.0, 8, 2, 69.55),
 (159, 0, 3, 'Mr. John Hatfield Cribb', 'male', 44.0, 0, 1, 16.1),
 (160,
  1,
  2,
  'Mrs. James (Elizabeth Inglis Milne) Watt',
  'female',
  40.0,
  0,
  0,
  15.75),
 (161, 0, 3, 'Mr. John Viktor Bengtsson', 'male', 26.0, 0, 0, 7.775),
 (162, 0, 3, 'Mr. Jovo Calic', 'male', 17.0, 0, 0, 8.6625),
 (163, 0, 3, 'Master. Eino Viljami Panula', 'male', 1.0, 4, 1, 39.6875),
 (164,
  1,
  3,
  'Master. Frank John William Goldsmith',
  'male',
  9.0,
  0,
  2,
  20.525),
 (165,
  1,
  1,
  'Mrs. (Edith Martha Bowerman) Chibnall',
  'female',
  48.0,
  0,
  1,
  55.0),
 (166,
  0,
  3,
  'Mrs. William (Anna Bernhardina Karlsson) Skoog',
  'female',
  45.0,
  1,
  4,
  27.9),
 (167, 0, 1, 'Mr. John D Baumann', 'male', 60.0, 0, 0, 25.925),
 (168, 0, 3, 'Mr. Lee Ling', 'male', 28.0, 0, 0, 56.4958),
 (169, 0, 1, 'Mr. Wyckoff Van der hoef', 'male', 61.0, 0, 0, 33.5),
 (170, 0, 3, 'Master. Arthur Rice', 'male', 4.0, 4, 1, 29.125),
 (171, 1, 3, 'Miss. Eleanor Ileen Johnson', 'female', 1.0, 1, 1, 11.1333),
 (172, 0, 3, 'Mr. Antti Wilhelm Sivola', 'male', 21.0, 0, 0, 7.925),
 (173, 0, 1, 'Mr. James Clinch Smith', 'male', 56.0, 0, 0, 30.6958),
 (174, 0, 3, 'Mr. Klas Albin Klasen', 'male', 18.0, 1, 1, 7.8542),
 (175, 0, 3, 'Master. Henry Forbes Lefebre', 'male', 5.0, 3, 1, 25.4667),
 (176, 0, 1, 'Miss. Ann Elizabeth Isham', 'female', 50.0, 0, 0, 28.7125),
 (177, 0, 2, 'Mr. Reginald Hale', 'male', 30.0, 0, 0, 13.0),
 (178, 0, 3, 'Mr. Lionel Leonard', 'male', 36.0, 0, 0, 0.0),
 (179, 0, 3, 'Miss. Constance Gladys Sage', 'female', 8.0, 8, 2, 69.55),
 (180, 0, 2, 'Mr. Rene Pernot', 'male', 39.0, 0, 0, 15.05),
 (181,
  0,
  3,
  'Master. Clarence Gustaf Hugo Asplund',
  'male',
  9.0,
  4,
  2,
  31.3875),
 (182, 1, 2, 'Master. Richard F Becker', 'male', 1.0, 2, 1, 39.0),
 (183,
  1,
  3,
  'Miss. Luise Gretchen Kink-Heilmann',
  'female',
  4.0,
  0,
  2,
  22.025),
 (184, 0, 1, 'Mr. Hugh Roscoe Rood', 'male', 39.0, 0, 0, 50.0),
 (185,
  1,
  3,
  'Mrs. Thomas (Johanna Godfrey) OBrien',
  'female',
  26.0,
  1,
  0,
  15.5),
 (186, 1, 1, 'Mr. Charles Hallace Romaine', 'male', 45.0, 0, 0, 26.55),
 (187, 0, 3, 'Mr. John Bourke', 'male', 40.0, 1, 1, 15.5),
 (188, 0, 3, 'Mr. Stjepan Turcin', 'male', 36.0, 0, 0, 7.8958),
 (189, 1, 2, 'Mrs. (Rosa) Pinsky', 'female', 32.0, 0, 0, 13.0),
 (190, 0, 2, 'Mr. William Carbines', 'male', 19.0, 0, 0, 13.0),
 (191,
  1,
  3,
  'Miss. Carla Christine Nielsine Andersen-Jensen',
  'female',
  19.0,
  1,
  0,
  7.8542),
 (192, 1, 2, 'Master. Michel M Navratil', 'male', 3.0, 1, 1, 26.0),
 (193,
  1,
  1,
  'Mrs. James Joseph (Margaret Tobin) Brown',
  'female',
  44.0,
  0,
  0,
  27.7208),
 (194, 1, 1, 'Miss. Elise Lurette', 'female', 58.0, 0, 0, 146.5208),
 (195, 0, 3, 'Mr. Robert Mernagh', 'male', 28.0, 0, 0, 7.75),
 (196, 0, 3, 'Mr. Karl Siegwart Andreas Olsen', 'male', 42.0, 0, 1, 8.4042),
 (197, 1, 3, 'Miss. Margaret Madigan', 'female', 21.0, 0, 0, 7.75),
 (198, 0, 2, 'Miss. Henriette Yrois', 'female', 24.0, 0, 0, 13.0),
 (199, 0, 3, 'Mr. Nestor Cyriel Vande Walle', 'male', 28.0, 0, 0, 9.5),
 (200, 0, 3, 'Mr. Frederick Sage', 'male', 17.0, 8, 2, 69.55),
 (201, 0, 3, 'Mr. Jakob Alfred Johanson', 'male', 34.0, 0, 0, 6.4958),
 (202, 0, 3, 'Mr. Gerious Youseff', 'male', 45.5, 0, 0, 7.225),
 (203, 1, 3, 'Mr. Gurshon Cohen', 'male', 18.0, 0, 0, 8.05),
 (204, 0, 3, 'Miss. Telma Matilda Strom', 'female', 2.0, 0, 1, 10.4625),
 (205, 0, 3, 'Mr. Karl Alfred Backstrom', 'male', 32.0, 1, 0, 15.85),
 (206, 1, 3, 'Mr. Nassef Cassem Albimona', 'male', 26.0, 0, 0, 18.7875),
 (207, 1, 3, 'Miss. Helen Carr', 'female', 16.0, 0, 0, 7.75),
 (208, 1, 1, 'Mr. Henry Blank', 'male', 40.0, 0, 0, 31.0),
 (209, 0, 3, 'Mr. Ahmed Ali', 'male', 24.0, 0, 0, 7.05),
 (210, 1, 2, 'Miss. Clear Annie Cameron', 'female', 35.0, 0, 0, 21.0),
 (211, 0, 3, 'Mr. John Henry Perkin', 'male', 22.0, 0, 0, 7.25),
 (212, 0, 2, 'Mr. Hans Kristensen Givard', 'male', 30.0, 0, 0, 13.0),
 (213, 0, 3, 'Mr. Philip Kiernan', 'male', 22.0, 1, 0, 7.75),
 (214, 1, 1, 'Miss. Madeleine Newell', 'female', 31.0, 1, 0, 113.275),
 (215, 1, 3, 'Miss. Eliina Honkanen', 'female', 27.0, 0, 0, 7.925),
 (216, 0, 2, 'Mr. Sidney Samuel Jacobsohn', 'male', 42.0, 1, 0, 27.0),
 (217, 1, 1, 'Miss. Albina Bazzani', 'female', 32.0, 0, 0, 76.2917),
 (218, 0, 2, 'Mr. Walter Harris', 'male', 30.0, 0, 0, 10.5),
 (219, 1, 3, 'Mr. Victor Francis Sunderland', 'male', 16.0, 0, 0, 8.05),
 (220, 0, 2, 'Mr. James H Bracken', 'male', 27.0, 0, 0, 13.0),
 (221, 0, 3, 'Mr. George Henry Green', 'male', 51.0, 0, 0, 8.05),
 (222, 0, 3, 'Mr. Christo Nenkoff', 'male', 22.0, 0, 0, 7.8958),
 (223, 1, 1, 'Mr. Frederick Maxfield Hoyt', 'male', 38.0, 1, 0, 90.0),
 (224, 0, 3, 'Mr. Karl Ivar Sven Berglund', 'male', 22.0, 0, 0, 9.35),
 (225, 1, 2, 'Mr. William John Mellors', 'male', 19.0, 0, 0, 10.5),
 (226, 0, 3, 'Mr. John Hall Lovell', 'male', 20.5, 0, 0, 7.25),
 (227, 0, 2, 'Mr. Arne Jonas Fahlstrom', 'male', 18.0, 0, 0, 13.0),
 (228, 0, 3, 'Miss. Mathilde Lefebre', 'female', 12.0, 3, 1, 25.4667),
 (229,
  1,
  1,
  'Mrs. Henry Birkhardt (Irene Wallach) Harris',
  'female',
  35.0,
  1,
  0,
  83.475),
 (230, 0, 3, 'Mr. Bengt Edvin Larsson', 'male', 29.0, 0, 0, 7.775),
 (231, 0, 2, 'Mr. Ernst Adolf Sjostedt', 'male', 59.0, 0, 0, 13.5),
 (232, 1, 3, 'Miss. Lillian Gertrud Asplund', 'female', 5.0, 4, 2, 31.3875),
 (233, 0, 2, 'Mr. Robert William Norman Leyson', 'male', 24.0, 0, 0, 10.5),
 (234, 0, 3, 'Miss. Alice Phoebe Harknett', 'female', 21.0, 0, 0, 7.55),
 (235, 0, 2, 'Mr. Stephen Hold', 'male', 44.0, 1, 0, 26.0),
 (236, 1, 2, 'Miss. Marjorie Collyer', 'female', 8.0, 0, 2, 26.25),
 (237, 0, 2, 'Mr. Frederick William Pengelly', 'male', 19.0, 0, 0, 10.5),
 (238, 0, 2, 'Mr. George Henry Hunt', 'male', 33.0, 0, 0, 12.275),
 (239, 0, 3, 'Miss. Thamine Zabour', 'female', 19.0, 1, 0, 14.4542),
 (240, 1, 3, 'Miss. Katherine Murphy', 'female', 18.0, 1, 0, 15.5),
 (241, 0, 2, 'Mr. Reginald Charles Coleridge', 'male', 29.0, 0, 0, 10.5),
 (242, 0, 3, 'Mr. Matti Alexanteri Maenpaa', 'male', 22.0, 0, 0, 7.125),
 (243, 0, 3, 'Mr. Sleiman Attalah', 'male', 30.0, 0, 0, 7.225),
 (244, 0, 1, 'Dr. William Edward Minahan', 'male', 44.0, 2, 0, 90.0),
 (245,
  0,
  3,
  'Miss. Agda Thorilda Viktoria Lindahl',
  'female',
  25.0,
  0,
  0,
  7.775),
 (246, 1, 2, 'Mrs. William (Anna) Hamalainen', 'female', 24.0, 0, 2, 14.5),
 (247, 1, 1, 'Mr. Richard Leonard Beckwith', 'male', 37.0, 1, 1, 52.5542),
 (248, 0, 2, 'Rev. Ernest Courtenay Carter', 'male', 54.0, 1, 0, 26.0),
 (249, 0, 3, 'Mr. James George Reed', 'male', 18.0, 0, 0, 7.25),
 (250,
  0,
  3,
  'Mrs. Wilhelm (Elna Matilda Persson) Strom',
  'female',
  29.0,
  1,
  1,
  10.4625),
 (251, 0, 1, 'Mr. William Thomas Stead', 'male', 62.0, 0, 0, 26.55),
 (252, 0, 3, 'Mr. William Arthur Lobb', 'male', 30.0, 1, 0, 16.1),
 (253,
  0,
  3,
  'Mrs. Viktor (Helena Wilhelmina) Rosblom',
  'female',
  41.0,
  0,
  2,
  20.2125),
 (254,
  1,
  3,
  'Mrs. Darwis (Hanne Youssef Razi) Touma',
  'female',
  29.0,
  0,
  2,
  15.2458),
 (255, 1, 1, 'Mrs. Gertrude Maybelle Thorne', 'female', 38.0, 0, 0, 79.2),
 (256, 1, 1, 'Miss. Gladys Cherry', 'female', 30.0, 0, 0, 86.5),
 (257, 1, 1, 'Miss. Anna Ward', 'female', 35.0, 0, 0, 512.3292),
 (258, 1, 2, 'Mrs. (Lutie Davis) Parrish', 'female', 50.0, 0, 1, 26.0),
 (259, 1, 3, 'Master. Edvin Rojj Felix Asplund', 'male', 3.0, 4, 2, 31.3875),
 (260, 0, 1, 'Mr. Emil Taussig', 'male', 52.0, 1, 1, 79.65),
 (261, 0, 1, 'Mr. William Harrison', 'male', 40.0, 0, 0, 0.0),
 (262, 0, 3, 'Miss. Delia Henry', 'female', 21.0, 0, 0, 7.75),
 (263, 0, 2, 'Mr. David Reeves', 'male', 36.0, 0, 0, 10.5),
 (264, 0, 3, 'Mr. Ernesti Arvid Panula', 'male', 16.0, 4, 1, 39.6875),
 (265, 1, 3, 'Mr. Ernst Ulrik Persson', 'male', 25.0, 1, 0, 7.775),
 (266,
  1,
  1,
  'Mrs. William Thompson (Edith Junkins) Graham',
  'female',
  58.0,
  0,
  1,
  153.4625),
 (267, 1, 1, 'Miss. Amelia Bissette', 'female', 35.0, 0, 0, 135.6333),
 (268, 0, 1, 'Mr. Alexander Cairns', 'male', 28.0, 0, 0, 31.0),
 (269, 1, 3, 'Mr. William Henry Tornquist', 'male', 25.0, 0, 0, 0.0),
 (270,
  1,
  2,
  'Mrs. (Elizabeth Anne Maidment) Mellinger',
  'female',
  41.0,
  0,
  1,
  19.5),
 (271, 0, 1, 'Mr. Charles H Natsch', 'male', 37.0, 0, 1, 29.7),
 (272, 1, 3, 'Miss. Hanora Healy', 'female', 33.0, 0, 0, 7.75),
 (273,
  1,
  1,
  'Miss. Kornelia Theodosia Andrews',
  'female',
  63.0,
  1,
  0,
  77.9583),
 (274, 0, 3, 'Miss. Augusta Charlotta Lindblom', 'female', 45.0, 0, 0, 7.75),

In [14]:
# insert statement
insert = """
INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare) 
VALUES """

In [15]:
# Sample insert 
insert + str(chars[0][1:])

# I hope that the line breaks are fine

"\nINSERT INTO titanic_table\n(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare) \nVALUES (0, 3, 'Mr. Owen Harris Braund', 'male', 22.0, 1, 0, 7.25)"

In [16]:
for char in chars:
    insert_query = insert + str(char[1:])
    pg_curs.execute(insert_query)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Owen Harris Braund', 'male', 22.0, 1, 0, 7.25)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mrs. John Bradley (Florence Briggs Thayer) Cumings', 'female', 38.0, 1, 0, 71.2833)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Miss. Laina Heikkinen', 'female', 26.0, 0, 0, 7.925)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mrs. Jacques Heath (Lily May Peel) Futrelle', 'female', 35.0, 1, 0, 53.1)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. William Henry Allen', 'male', 35.0, 0, 0, 8.05)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. James Moran', 'male', 27.0, 0, 0, 8.4583)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. Timothy J McCarthy', 'male', 54.0, 0, 0, 51.8625)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Master. Gosta Leonard Palsson', 'male', 2.0, 3, 1, 21.075)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mrs. Oscar W (Elisabeth Vilhelmina Berg) Johnson', 'female', 27.0, 0, 2, 11.1333)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Mrs. Nicholas (Adele Achem) Nasser', 'female', 14.0, 1, 0, 30.0708)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Miss. Marguerite Rut Sandstrom', 'female', 4.0, 1, 1, 16.7)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Miss. Elizabeth Bonnell', 'female', 58.0, 0, 0, 26.55)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. William Henry Saundercock', 'male', 20.0, 0, 0, 8.05)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Anders Johan Andersson', 'male', 39.0, 1, 5, 31.275)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Miss. Hulda Amanda Adolfina Vestrom', 'female', 14.0, 0, 0, 7.8542)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Mrs. (Mary D Kingcome) Hewlett', 'female', 55.0, 0, 0, 16.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Master. Eugene Rice', 'male', 2.0, 4, 1, 29.125)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Mr. Charles Eugene Williams', 'male', 23.0, 0, 0, 13.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mrs. Julius (Emelia Maria Vandemoortele) Vander Planke', 'female', 31.0, 1, 0, 18.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mrs. Fatima Masselmani', 'female', 22.0, 0, 0, 7.225)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Joseph J Fynney', 'male', 35.0, 0, 0, 26.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Mr. Lawrence Beesley', 'male', 34.0, 0, 0, 13.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Miss. Anna McGowan', 'female', 15.0, 0, 0, 8.0292)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mr. William Thompson Sloper', 'male', 28.0, 0, 0, 35.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Miss. Torborg Danira Palsson', 'female', 8.0, 3, 1, 21.075)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mrs. Carl Oscar (Selma Augusta Emilia Johansson) Asplund', 'female', 38.0, 1, 5, 31.3875)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Farred Chehab Emir', 'male', 26.0, 0, 0, 7.225)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. Charles Alexander Fortune', 'male', 19.0, 3, 2, 263.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Miss. Ellen ODwyer', 'female', 24.0, 0, 0, 7.8792)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Lalio Todoroff', 'male', 23.0, 0, 0, 7.8958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Don. Manuel E Uruchurtu', 'male', 40.0, 0, 0, 27.7208)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mrs. William Augustus (Marie Eugenie) Spencer', 'female', 48.0, 1, 0, 146.5208)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Miss. Mary Agatha Glynn', 'female', 18.0, 0, 0, 7.75)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Edward H Wheadon', 'male', 66.0, 0, 0, 10.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. Edgar Joseph Meyer', 'male', 28.0, 1, 0, 82.1708)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. Alexander Oskar Holverson', 'male', 42.0, 1, 0, 52.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mr. Hanna Mamee', 'male', 18.0, 0, 0, 7.2292)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Ernest Charles Cann', 'male', 21.0, 0, 0, 8.05)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Miss. Augusta Maria Vander Planke', 'female', 18.0, 2, 0, 18.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Miss. Jamila Nicola-Yarred', 'female', 14.0, 1, 0, 11.2417)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mrs. Johan (Johanna Persdotter Larsson) Ahlin', 'female', 40.0, 1, 0, 9.475)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mrs. William John Robert (Dorothy Ann Wonnacott) Turpin', 'female', 27.0, 1, 0, 21.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Miss. Simonne Marie Anne Andree Laroche', 'female', 3.0, 1, 2, 41.5792)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Miss. Margaret Delia Devaney', 'female', 19.0, 0, 0, 7.8792)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. William John Rogers', 'male', 30.0, 0, 0, 8.05)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Denis Lennon', 'male', 20.0, 1, 0, 15.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Miss. Bridget ODriscoll', 'female', 27.0, 0, 0, 7.75)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Youssef Samaan', 'male', 16.0, 2, 0, 21.6792)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mrs. Josef (Josefine Franchi) Arnold-Franchi', 'female', 18.0, 1, 0, 17.8)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Master. Juha Niilo Panula', 'male', 7.0, 4, 1, 39.6875)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Richard Cater Nosworthy', 'male', 21.0, 0, 0, 7.8)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mrs. Henry Sleeper (Myna Haxtun) Harper', 'female', 49.0, 1, 0, 76.7292)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Mrs. Lizzie (Elizabeth Anne Wilkinson) Faunthorpe', 'female', 29.0, 1, 0, 26.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. Engelhart Cornelius Ostby', 'male', 65.0, 0, 1, 61.9792)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mr. Hugh Woolner', 'male', 46.0, 0, 0, 35.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Miss. Emily Rugg', 'female', 21.0, 0, 0, 10.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Mansouer Novel', 'male', 28.5, 0, 0, 7.2292)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Miss. Constance Mirium West', 'female', 5.0, 1, 2, 27.75)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Master. William Frederick Goodwin', 'male', 11.0, 5, 2, 46.9)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Orsen Sirayanian', 'male', 22.0, 0, 0, 7.2292)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Miss. Amelie Icard', 'female', 38.0, 0, 0, 80.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. Henry Birkhardt Harris', 'male', 45.0, 1, 0, 83.475)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Master. Harald Skoog', 'male', 4.0, 3, 2, 27.9)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. Albert A Stewart', 'male', 64.0, 0, 0, 27.7208)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Master. Gerios Moubarek', 'male', 7.0, 1, 1, 15.2458)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Mrs. (Elizabeth Ramell) Nye', 'female', 29.0, 0, 0, 10.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Ernest James Crease', 'male', 19.0, 0, 0, 8.1583)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Miss. Erna Alexandra Andersson', 'female', 17.0, 4, 2, 7.925)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Vincenz Kink', 'male', 26.0, 2, 0, 8.6625)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Stephen Curnow Jenkin', 'male', 32.0, 0, 0, 10.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Miss. Lillian Amy Goodwin', 'female', 16.0, 5, 2, 46.9)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Ambrose Jr Hood', 'male', 21.0, 0, 0, 73.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Apostolos Chronopoulos', 'male', 26.0, 1, 0, 14.4542)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mr. Lee Bing', 'male', 32.0, 0, 0, 56.4958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Sigurd Hansen Moen', 'male', 25.0, 0, 0, 7.65)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Ivan Staneff', 'male', 23.0, 0, 0, 7.8958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Rahamin Haim Moutal', 'male', 28.0, 0, 0, 8.05)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Master. Alden Gates Caldwell', 'male', 0.83, 0, 2, 29.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Miss. Elizabeth Dowdell', 'female', 30.0, 0, 0, 12.475)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Achille Waelens', 'male', 22.0, 0, 0, 9.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mr. Jan Baptist Sheerlinck', 'male', 29.0, 0, 0, 9.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Miss. Brigdet Delia McDermott', 'female', 31.0, 0, 0, 7.7875)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. Francisco M Carrau', 'male', 28.0, 0, 0, 47.1)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Miss. Bertha Ilett', 'female', 17.0, 0, 0, 10.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mrs. Karl Alfred (Maria Mathilda Gustafsson) Backstrom', 'female', 33.0, 3, 0, 15.85)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. William Neal Ford', 'male', 16.0, 1, 3, 34.375)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Selman Francis Slocovski', 'male', 20.0, 0, 0, 8.05)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Miss. Mabel Helen Fortune', 'female', 23.0, 3, 2, 263.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Francesco Celotti', 'male', 24.0, 0, 0, 8.05)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Emil Christmann', 'male', 29.0, 0, 0, 8.05)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Paul Edvin Andreasson', 'male', 20.0, 0, 0, 7.8542)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. Herbert Fuller Chaffee', 'male', 46.0, 1, 0, 61.175)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Bertram Frank Dean', 'male', 26.0, 1, 2, 20.575)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Daniel Coxon', 'male', 59.0, 0, 0, 7.25)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Charles Joseph Shorney', 'male', 22.0, 0, 0, 8.05)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. George B Goldschmidt', 'male', 71.0, 0, 0, 34.6542)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mr. William Bertram Greenfield', 'male', 23.0, 0, 1, 63.3583)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Mrs. John T (Ada Julia Bone) Doling', 'female', 34.0, 0, 1, 23.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Sinai Kantor', 'male', 34.0, 1, 0, 26.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Miss. Matilda Petranec', 'female', 28.0, 0, 0, 7.8958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Pastcho Petroff', 'male', 29.0, 0, 0, 7.8958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. Richard Frasar White', 'male', 21.0, 0, 1, 77.2875)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Gustaf Joel Johansson', 'male', 33.0, 0, 0, 8.6542)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Anders Vilhelm Gustafsson', 'male', 37.0, 2, 0, 7.925)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Stoytcho Mionoff', 'male', 28.0, 0, 0, 7.8958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Miss. Anna Kristine Salkjelsvik', 'female', 21.0, 0, 0, 7.65)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mr. Albert Johan Moss', 'male', 29.0, 0, 0, 7.775)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Tido Rekic', 'male', 38.0, 0, 0, 7.8958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Miss. Bertha Moran', 'female', 28.0, 1, 0, 24.15)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. Walter Chamberlain Porter', 'male', 47.0, 0, 0, 52.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Miss. Hileni Zabour', 'female', 14.5, 1, 0, 14.4542)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. David John Barton', 'male', 22.0, 0, 0, 8.05)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Miss. Katriina Jussila', 'female', 20.0, 1, 0, 9.825)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Miss. Malake Attalah', 'female', 17.0, 0, 0, 14.4583)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Edvard Pekoniemi', 'male', 21.0, 0, 0, 7.925)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Patrick Connors', 'male', 70.5, 0, 0, 7.75)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. William John Robert Turpin', 'male', 29.0, 1, 0, 21.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. Quigg Edmond Baxter', 'male', 24.0, 0, 1, 247.5208)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Miss. Ellis Anna Maria Andersson', 'female', 2.0, 4, 2, 31.275)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Stanley George Hickman', 'male', 21.0, 2, 0, 73.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Leonard Charles Moore', 'male', 19.0, 0, 0, 8.05)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Nicholas Nasser', 'male', 32.5, 1, 0, 30.0708)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Miss. Susan Webber', 'female', 32.5, 0, 0, 13.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. Percival Wayland White', 'male', 54.0, 0, 1, 77.2875)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Master. Elias Nicola-Yarred', 'male', 12.0, 1, 0, 11.2417)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Martin McMahon', 'male', 19.0, 0, 0, 7.75)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mr. Fridtjof Arne Madsen', 'male', 24.0, 0, 0, 7.1417)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Miss. Anna Peter', 'female', 2.0, 1, 1, 22.3583)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Johan Ekstrom', 'male', 45.0, 0, 0, 6.975)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Jozef Drazenoic', 'male', 33.0, 0, 0, 7.8958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Domingos Fernandeo Coelho', 'male', 20.0, 0, 0, 7.05)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mrs. Alexander A (Grace Charity Laury) Robins', 'female', 47.0, 1, 0, 14.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Mrs. Leopold (Mathilde Francoise Pede) Weisz', 'female', 29.0, 1, 0, 26.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Samuel James Hayden Sobey', 'male', 25.0, 0, 0, 13.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)

VALUES (0, 2, 'Mr. Emile Richard', 'male', 23.0, 0, 0, 15.0458)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Miss. Helen Monypeny Newsom', 'female', 19.0, 0, 2, 26.2833)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. Jacques Heath Futrelle', 'male', 37.0, 1, 0, 53.1)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Olaf Elon Osen', 'male', 16.0, 0, 0, 9.2167)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. Victor Giglio', 'male', 24.0, 0, 0, 79.2)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mrs. Joseph (Sultana) Boulos', 'female', 40.0, 0, 2, 15.2458)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Miss. Anna Sofia Nysten', 'female', 22.0, 0, 0, 7.75)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mrs. Pekka Pietari (Elin Matilda Dolck) Hakkarainen', 'female', 24.0, 1, 0, 15.85)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Jeremiah Burke', 'male', 19.0, 0, 0, 6.75)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Edgardo Samuel Andrew', 'male', 18.0, 0, 0, 11.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Joseph Charles Nicholls', 'male', 19.0, 1, 1, 36.75)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mr. August Edvard Andersson', 'male', 27.0, 0, 0, 7.7958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Miss. Robina Maggie Ford', 'female', 9.0, 2, 2, 34.375)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Michel Navratil', 'male', 36.5, 0, 2, 26.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Rev. Thomas Roussel Davids Byles', 'male', 42.0, 0, 0, 13.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Rev. Robert James Bateman', 'male', 51.0, 0, 0, 12.525)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mrs. Thomas (Edith Wearne) Pears', 'female', 22.0, 1, 0, 66.6)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Alfonzo Meo', 'male', 55.5, 0, 0, 8.05)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Austin Blyler van Billiard', 'male', 40.5, 0, 2, 14.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Ole Martin Olsen', 'male', 27.0, 0, 0, 7.3125)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. Charles Duane Williams', 'male', 51.0, 0, 1, 61.3792)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Miss. Katherine Gilnagh', 'female', 16.0, 0, 0, 7.7333)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Harry Corn', 'male', 30.0, 0, 0, 8.05)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Mile Smiljanic', 'male', 37.0, 0, 0, 8.6625)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Master. Thomas Henry Sage', 'male', 5.0, 8, 2, 69.55)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. John Hatfield Cribb', 'male', 44.0, 0, 1, 16.1)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Mrs. James (Elizabeth Inglis Milne) Watt', 'female', 40.0, 0, 0, 15.75)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. John Viktor Bengtsson', 'male', 26.0, 0, 0, 7.775)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Jovo Calic', 'male', 17.0, 0, 0, 8.6625)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Master. Eino Viljami Panula', 'male', 1.0, 4, 1, 39.6875)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Master. Frank John William Goldsmith', 'male', 9.0, 0, 2, 20.525)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mrs. (Edith Martha Bowerman) Chibnall', 'female', 48.0, 0, 1, 55.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mrs. William (Anna Bernhardina Karlsson) Skoog', 'female', 45.0, 1, 4, 27.9)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. John D Baumann', 'male', 60.0, 0, 0, 25.925)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Lee Ling', 'male', 28.0, 0, 0, 56.4958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. Wyckoff Van der hoef', 'male', 61.0, 0, 0, 33.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Master. Arthur Rice', 'male', 4.0, 4, 1, 29.125)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Miss. Eleanor Ileen Johnson', 'female', 1.0, 1, 1, 11.1333)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Antti Wilhelm Sivola', 'male', 21.0, 0, 0, 7.925)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. James Clinch Smith', 'male', 56.0, 0, 0, 30.6958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Klas Albin Klasen', 'male', 18.0, 1, 1, 7.8542)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Master. Henry Forbes Lefebre', 'male', 5.0, 3, 1, 25.4667)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Miss. Ann Elizabeth Isham', 'female', 50.0, 0, 0, 28.7125)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Reginald Hale', 'male', 30.0, 0, 0, 13.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Lionel Leonard', 'male', 36.0, 0, 0, 0.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Miss. Constance Gladys Sage', 'female', 8.0, 8, 2, 69.55)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Rene Pernot', 'male', 39.0, 0, 0, 15.05)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Master. Clarence Gustaf Hugo Asplund', 'male', 9.0, 4, 2, 31.3875)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Master. Richard F Becker', 'male', 1.0, 2, 1, 39.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Miss. Luise Gretchen Kink-Heilmann', 'female', 4.0, 0, 2, 22.025)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. Hugh Roscoe Rood', 'male', 39.0, 0, 0, 50.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mrs. Thomas (Johanna Godfrey) OBrien', 'female', 26.0, 1, 0, 15.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mr. Charles Hallace Romaine', 'male', 45.0, 0, 0, 26.55)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. John Bourke', 'male', 40.0, 1, 1, 15.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Stjepan Turcin', 'male', 36.0, 0, 0, 7.8958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Mrs. (Rosa) Pinsky', 'female', 32.0, 0, 0, 13.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. William Carbines', 'male', 19.0, 0, 0, 13.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Miss. Carla Christine Nielsine Andersen-Jensen', 'female', 19.0, 1, 0, 7.8542)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Master. Michel M Navratil', 'male', 3.0, 1, 1, 26.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mrs. James Joseph (Margaret Tobin) Brown', 'female', 44.0, 0, 0, 27.7208)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Miss. Elise Lurette', 'female', 58.0, 0, 0, 146.5208)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Robert Mernagh', 'male', 28.0, 0, 0, 7.75)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Karl Siegwart Andreas Olsen', 'male', 42.0, 0, 1, 8.4042)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Miss. Margaret Madigan', 'female', 21.0, 0, 0, 7.75)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Miss. Henriette Yrois', 'female', 24.0, 0, 0, 13.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Nestor Cyriel Vande Walle', 'male', 28.0, 0, 0, 9.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Frederick Sage', 'male', 17.0, 8, 2, 69.55)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Jakob Alfred Johanson', 'male', 34.0, 0, 0, 6.4958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Gerious Youseff', 'male', 45.5, 0, 0, 7.225)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mr. Gurshon Cohen', 'male', 18.0, 0, 0, 8.05)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Miss. Telma Matilda Strom', 'female', 2.0, 0, 1, 10.4625)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Karl Alfred Backstrom', 'male', 32.0, 1, 0, 15.85)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mr. Nassef Cassem Albimona', 'male', 26.0, 0, 0, 18.7875)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Miss. Helen Carr', 'female', 16.0, 0, 0, 7.75)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mr. Henry Blank', 'male', 40.0, 0, 0, 31.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Ahmed Ali', 'male', 24.0, 0, 0, 7.05)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Miss. Clear Annie Cameron', 'female', 35.0, 0, 0, 21.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. John Henry Perkin', 'male', 22.0, 0, 0, 7.25)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Hans Kristensen Givard', 'male', 30.0, 0, 0, 13.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Philip Kiernan', 'male', 22.0, 1, 0, 7.75)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Miss. Madeleine Newell', 'female', 31.0, 1, 0, 113.275)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Miss. Eliina Honkanen', 'female', 27.0, 0, 0, 7.925)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Sidney Samuel Jacobsohn', 'male', 42.0, 1, 0, 27.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Miss. Albina Bazzani', 'female', 32.0, 0, 0, 76.2917)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Walter Harris', 'male', 30.0, 0, 0, 10.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mr. Victor Francis Sunderland', 'male', 16.0, 0, 0, 8.05)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. James H Bracken', 'male', 27.0, 0, 0, 13.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. George Henry Green', 'male', 51.0, 0, 0, 8.05)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Christo Nenkoff', 'male', 22.0, 0, 0, 7.8958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mr. Frederick Maxfield Hoyt', 'male', 38.0, 1, 0, 90.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Karl Ivar Sven Berglund', 'male', 22.0, 0, 0, 9.35)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Mr. William John Mellors', 'male', 19.0, 0, 0, 10.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. John Hall Lovell', 'male', 20.5, 0, 0, 7.25)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Arne Jonas Fahlstrom', 'male', 18.0, 0, 0, 13.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Miss. Mathilde Lefebre', 'female', 12.0, 3, 1, 25.4667)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mrs. Henry Birkhardt (Irene Wallach) Harris', 'female', 35.0, 1, 0, 83.475)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Bengt Edvin Larsson', 'male', 29.0, 0, 0, 7.775)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Ernst Adolf Sjostedt', 'male', 59.0, 0, 0, 13.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Miss. Lillian Gertrud Asplund', 'female', 5.0, 4, 2, 31.3875)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Robert William Norman Leyson', 'male', 24.0, 0, 0, 10.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Miss. Alice Phoebe Harknett', 'female', 21.0, 0, 0, 7.55)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Stephen Hold', 'male', 44.0, 1, 0, 26.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Miss. Marjorie Collyer', 'female', 8.0, 0, 2, 26.25)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Frederick William Pengelly', 'male', 19.0, 0, 0, 10.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. George Henry Hunt', 'male', 33.0, 0, 0, 12.275)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Miss. Thamine Zabour', 'female', 19.0, 1, 0, 14.4542)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Miss. Katherine Murphy', 'female', 18.0, 1, 0, 15.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Reginald Charles Coleridge', 'male', 29.0, 0, 0, 10.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Matti Alexanteri Maenpaa', 'male', 22.0, 0, 0, 7.125)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Sleiman Attalah', 'male', 30.0, 0, 0, 7.225)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Dr. William Edward Minahan', 'male', 44.0, 2, 0, 90.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Miss. Agda Thorilda Viktoria Lindahl', 'female', 25.0, 0, 0, 7.775)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Mrs. William (Anna) Hamalainen', 'female', 24.0, 0, 2, 14.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mr. Richard Leonard Beckwith', 'male', 37.0, 1, 1, 52.5542)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Rev. Ernest Courtenay Carter', 'male', 54.0, 1, 0, 26.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. James George Reed', 'male', 18.0, 0, 0, 7.25)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mrs. Wilhelm (Elna Matilda Persson) Strom', 'female', 29.0, 1, 1, 10.4625)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. William Thomas Stead', 'male', 62.0, 0, 0, 26.55)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. William Arthur Lobb', 'male', 30.0, 1, 0, 16.1)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mrs. Viktor (Helena Wilhelmina) Rosblom', 'female', 41.0, 0, 2, 20.2125)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mrs. Darwis (Hanne Youssef Razi) Touma', 'female', 29.0, 0, 2, 15.2458)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mrs. Gertrude Maybelle Thorne', 'female', 38.0, 0, 0, 79.2)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Miss. Gladys Cherry', 'female', 30.0, 0, 0, 86.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Miss. Anna Ward', 'female', 35.0, 0, 0, 512.3292)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Mrs. (Lutie Davis) Parrish', 'female', 50.0, 0, 1, 26.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Master. Edvin Rojj Felix Asplund', 'male', 3.0, 4, 2, 31.3875)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. Emil Taussig', 'male', 52.0, 1, 1, 79.65)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. William Harrison', 'male', 40.0, 0, 0, 0.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Miss. Delia Henry', 'female', 21.0, 0, 0, 7.75)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. David Reeves', 'male', 36.0, 0, 0, 10.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Ernesti Arvid Panula', 'male', 16.0, 4, 1, 39.6875)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mr. Ernst Ulrik Persson', 'male', 25.0, 1, 0, 7.775)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mrs. William Thompson (Edith Junkins) Graham', 'female', 58.0, 0, 1, 153.4625)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Miss. Amelia Bissette', 'female', 35.0, 0, 0, 135.6333)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. Alexander Cairns', 'male', 28.0, 0, 0, 31.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mr. William Henry Tornquist', 'male', 25.0, 0, 0, 0.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Mrs. (Elizabeth Anne Maidment) Mellinger', 'female', 41.0, 0, 1, 19.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. Charles H Natsch', 'male', 37.0, 0, 1, 29.7)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Miss. Hanora Healy', 'female', 33.0, 0, 0, 7.75)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Miss. Kornelia Theodosia Andrews', 'female', 63.0, 1, 0, 77.9583)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Miss. Augusta Charlotta Lindblom', 'female', 45.0, 0, 0, 7.75)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Francis Parkes', 'male', 21.0, 0, 0, 0.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Master. Eric Rice', 'male', 7.0, 4, 1, 29.125)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mrs. Stanton (Rosa Hunt) Abbott', 'female', 35.0, 1, 1, 20.25)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Frank Duane', 'male', 65.0, 0, 0, 7.75)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Nils Johan Goransson Olsson', 'male', 28.0, 0, 0, 7.8542)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Alfons de Pelsmaeker', 'male', 16.0, 0, 0, 9.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mr. Edward Arthur Dorking', 'male', 19.0, 0, 0, 8.05)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. Richard William Smith', 'male', 57.0, 0, 0, 26.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Ivan Stankovic', 'male', 33.0, 0, 0, 8.6625)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mr. Theodore de Mulder', 'male', 30.0, 0, 0, 9.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Penko Naidenoff', 'male', 22.0, 0, 0, 7.8958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Mr. Masabumi Hosono', 'male', 42.0, 0, 0, 13.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Miss. Kate Connolly', 'female', 22.0, 0, 0, 7.75)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Miss. Ellen Barber', 'female', 26.0, 0, 0, 78.85)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mrs. Dickinson H (Helen Walton) Bishop', 'female', 19.0, 1, 0, 91.0792)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Rene Jacques Levy', 'male', 36.0, 0, 0, 12.875)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Miss. Aloisia Haas', 'female', 24.0, 0, 0, 8.85)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Ivan Mineff', 'male', 24.0, 0, 0, 7.8958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. Ervin G Lewy', 'male', 30.0, 0, 0, 27.7208)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Mansour Hanna', 'male', 23.5, 0, 0, 7.2292)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Miss. Helen Loraine Allison', 'female', 2.0, 1, 2, 151.55)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mr. Adolphe Saalfeld', 'male', 47.0, 0, 0, 30.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mrs. James (Helene DeLaudeniere Chaput) Baxter', 'female', 50.0, 0, 1, 247.5208)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Miss. Anna Katherine Kelly', 'female', 20.0, 0, 0, 7.75)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mr. Bernard McCoy', 'male', 24.0, 2, 0, 23.25)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. William Cahoone Jr Johnson', 'male', 19.0, 0, 0, 0.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Miss. Nora A Keane', 'female', 46.0, 0, 0, 12.35)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Howard Hugh Williams', 'male', 28.0, 0, 0, 8.05)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Master. Hudson Trevor Allison', 'male', 0.92, 1, 2, 151.55)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Miss. Margaret Fleming', 'female', 42.0, 0, 0, 110.8833)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mrs. Victor de Satode (Maria Josefa Perez de Soto y Vallejo) Penasco y Castellana', 'female', 17.0, 1, 0, 108.9)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Samuel Abelson', 'male', 30.0, 1, 0, 24.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Miss. Laura Mabel Francatelli', 'female', 30.0, 0, 0, 56.9292)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Miss. Margaret Bechstein Hays', 'female', 24.0, 0, 0, 83.1583)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Miss. Emily Borie Ryerson', 'female', 18.0, 2, 2, 262.375)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mrs. William (Anna Sylfven) Lahtinen', 'female', 26.0, 1, 1, 26.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Ignjac Hendekovic', 'male', 28.0, 0, 0, 7.8958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Benjamin Hart', 'male', 43.0, 1, 1, 26.25)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Miss. Helmina Josefina Nilsson', 'female', 26.0, 0, 0, 7.8542)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Mrs. Sinai (Miriam Sternin) Kantor', 'female', 24.0, 1, 0, 26.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Dr. Ernest Moraweck', 'male', 54.0, 0, 0, 14.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Miss. Mary Natalie Wick', 'female', 31.0, 0, 2, 164.8667)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mrs. Frederic Oakley (Margaretta Corning Stone) Spedden', 'female', 40.0, 1, 1, 134.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Samuel Dennis', 'male', 22.0, 0, 0, 7.25)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Yoto Danoff', 'male', 27.0, 0, 0, 7.8958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Miss. Hilda Mary Slayter', 'female', 30.0, 0, 0, 12.35)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Mrs. Albert Francis (Sylvia Mae Harbaugh) Caldwell', 'female', 22.0, 1, 1, 29.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. George John Jr Sage', 'male', 20.0, 8, 2, 69.55)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Miss. Marie Grice Young', 'female', 36.0, 0, 0, 135.6333)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Johan Hansen Nysveen', 'male', 61.0, 0, 0, 6.2375)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Mrs. (Ada E Hall) Ball', 'female', 36.0, 0, 0, 13.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mrs. Frank John (Emily Alice Brown) Goldsmith', 'female', 31.0, 1, 1, 20.525)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Miss. Jean Gertrude Hippach', 'female', 16.0, 0, 1, 57.9792)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Miss. Agnes McCoy', 'female', 28.0, 2, 0, 23.25)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. Austen Partner', 'male', 45.5, 0, 0, 28.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. George Edward Graham', 'male', 38.0, 0, 1, 153.4625)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Leo Edmondus Vander Planke', 'male', 16.0, 2, 0, 18.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mrs. Henry William (Clara Heinsheimer) Frauenthal', 'female', 42.0, 1, 0, 133.65)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Mitto Denkoff', 'male', 30.0, 0, 0, 7.8958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. Thomas Clinton Pears', 'male', 29.0, 1, 0, 66.6)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Miss. Elizabeth Margaret Burns', 'female', 41.0, 0, 0, 134.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mr. Karl Edwart Dahl', 'male', 45.0, 0, 0, 8.05)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. Stephen Weart Blackwell', 'male', 45.0, 0, 0, 35.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Master. Edmond Roger Navratil', 'male', 2.0, 1, 1, 26.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Miss. Alice Elizabeth Fortune', 'female', 24.0, 3, 2, 263.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Erik Gustaf Collander', 'male', 28.0, 0, 0, 13.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Charles Frederick Waddington Sedgwick', 'male', 25.0, 0, 0, 13.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Stanley Hubert Fox', 'male', 36.0, 0, 0, 13.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Miss. Amelia Brown', 'female', 24.0, 0, 0, 13.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Miss. Marion Elsie Smith', 'female', 40.0, 0, 0, 13.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mrs. Thomas Henry (Mary E Finck) Davison', 'female', 34.0, 1, 0, 16.1)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Master. William Loch Coutts', 'male', 3.0, 1, 1, 15.9)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Jovan Dimic', 'male', 42.0, 0, 0, 8.6625)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Nils Martin Odahl', 'male', 23.0, 0, 0, 9.225)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. Fletcher Fellows Williams-Lambert', 'male', 43.0, 0, 0, 35.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Tannous Elias', 'male', 15.0, 1, 1, 7.2292)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Josef Arnold-Franchi', 'male', 25.0, 1, 0, 17.8)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Wazli Yousif', 'male', 23.0, 0, 0, 7.225)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Leo Peter Vanden Steen', 'male', 28.0, 0, 0, 9.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Miss. Elsie Edith Bowerman', 'female', 22.0, 0, 1, 55.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Miss. Annie Clemmer Funk', 'female', 38.0, 0, 0, 13.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Miss. Mary McGovern', 'female', 22.0, 0, 0, 7.8792)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Miss. Helen Mary Mockler', 'female', 23.0, 0, 0, 7.8792)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Wilhelm Skoog', 'male', 40.0, 1, 4, 27.9)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Sebastiano del Carlo', 'male', 29.0, 1, 0, 27.7208)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mrs. (Catherine David) Barbara', 'female', 45.0, 0, 1, 14.4542)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Adola Asim', 'male', 35.0, 0, 0, 7.05)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)

VALUES (0, 3, 'Mr. Thomas OBrien', 'male', 27.0, 1, 0, 15.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Mauritz Nils Martin Adahl', 'male', 30.0, 0, 0, 7.25)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mrs. Frank Manley (Anna Sophia Atkinson) Warren', 'female', 60.0, 1, 0, 75.25)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mrs. (Mantoura Boulos) Moussa', 'female', 35.0, 0, 0, 7.2292)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Miss. Annie Jermyn', 'female', 22.0, 0, 0, 7.75)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mme. Leontine Pauline Aubart', 'female', 24.0, 0, 0, 69.3)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mr. George Achilles Harder', 'male', 25.0, 1, 0, 55.4417)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Jakob Alfred Wiklund', 'male', 18.0, 1, 0, 6.4958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. William Thomas Beavan', 'male', 19.0, 0, 0, 8.05)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. Sante Ringhini', 'male', 22.0, 0, 0, 135.6333)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Miss. Stina Viola Palsson', 'female', 3.0, 3, 1, 21.075)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mrs. Edgar Joseph (Leila Saks) Meyer', 'female', 25.0, 1, 0, 82.1708)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Miss. Aurora Adelia Landergren', 'female', 22.0, 0, 0, 7.25)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. Harry Elkins Widener', 'male', 27.0, 0, 2, 211.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Tannous Betros', 'male', 20.0, 0, 0, 4.0125)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Karl Gideon Gustafsson', 'male', 19.0, 0, 0, 7.775)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Miss. Rosalie Bidois', 'female', 42.0, 0, 0, 227.525)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Miss. Maria Nakid', 'female', 1.0, 0, 2, 15.7417)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Juho Tikkanen', 'male', 32.0, 0, 0, 7.925)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mrs. Alexander Oskar (Mary Aline Towner) Holverson', 'female', 35.0, 1, 0, 52.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Vasil Plotcharsky', 'male', 27.0, 0, 0, 7.8958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Charles Henry Davies', 'male', 18.0, 0, 0, 73.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Master. Sidney Leonard Goodwin', 'male', 1.0, 5, 2, 46.9)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Miss. Kate Buss', 'female', 36.0, 0, 0, 13.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Matthew Sadlier', 'male', 19.0, 0, 0, 7.7292)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Miss. Bertha Lehmann', 'female', 17.0, 0, 0, 12.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mr. William Ernest Carter', 'male', 36.0, 1, 2, 120.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mr. Carl Olof Jansson', 'male', 21.0, 0, 0, 7.7958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Johan Birger Gustafsson', 'male', 28.0, 2, 0, 7.925)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Miss. Marjorie Newell', 'female', 23.0, 1, 0, 113.275)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mrs. Hjalmar (Agnes Charlotta Bengtsson) Sandstrom', 'female', 24.0, 0, 2, 16.7)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Erik Johansson', 'male', 22.0, 0, 0, 7.7958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Miss. Elina Olsson', 'female', 31.0, 0, 0, 7.8542)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Peter David McKane', 'male', 46.0, 0, 0, 26.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Dr. Alfred Pain', 'male', 23.0, 0, 0, 10.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Mrs. William H (Jessie L) Trout', 'female', 28.0, 0, 0, 12.65)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mr. Juha Niskanen', 'male', 39.0, 0, 0, 7.925)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. John Adams', 'male', 26.0, 0, 0, 8.05)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Miss. Mari Aina Jussila', 'female', 21.0, 1, 0, 9.825)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Pekka Pietari Hakkarainen', 'male', 28.0, 1, 0, 15.85)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Miss. Marija Oreskovic', 'female', 20.0, 0, 0, 8.6625)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Shadrach Gale', 'male', 34.0, 1, 0, 21.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Carl/Charles Peter Widegren', 'male', 51.0, 0, 0, 7.75)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Master. William Rowe Richards', 'male', 3.0, 1, 1, 18.75)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Hans Martin Monsen Birkeland', 'male', 21.0, 0, 0, 7.775)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Miss. Ida Lefebre', 'female', 3.0, 3, 1, 25.4667)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Todor Sdycoff', 'male', 42.0, 0, 0, 7.8958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Henry Hart', 'male', 27.0, 0, 0, 6.8583)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Miss. Daisy E Minahan', 'female', 33.0, 1, 0, 90.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Alfred Fleming Cunningham', 'male', 22.0, 0, 0, 0.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mr. Johan Julian Sundman', 'male', 44.0, 0, 0, 7.925)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mrs. Thomas (Annie Louise Rowley) Meek', 'female', 32.0, 0, 0, 8.05)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Mrs. James Vivian (Lulu Thorne Christian) Drew', 'female', 34.0, 1, 1, 32.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Miss. Lyyli Karoliina Silven', 'female', 18.0, 0, 2, 13.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. William John Matthews', 'male', 30.0, 0, 0, 13.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Miss. Catharina Van Impe', 'female', 10.0, 0, 2, 24.15)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. David Charters', 'male', 21.0, 0, 0, 7.7333)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Leo Zimmerman', 'male', 29.0, 0, 0, 7.875)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mrs. Ernst Gilbert (Anna Sigrid Maria Brogren) Danbom', 'female', 28.0, 1, 1, 14.4)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Viktor Richard Rosblom', 'male', 18.0, 1, 1, 20.2125)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Phillippe Wiseman', 'male', 54.0, 0, 0, 7.25)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Mrs. Charles V (Ada Maria Winfield) Clarke', 'female', 28.0, 1, 0, 26.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Miss. Kate Florence Phillips', 'female', 19.0, 0, 0, 26.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. James Flynn', 'male', 28.0, 0, 0, 7.75)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mr. Berk (Berk Trembisky) Pickard', 'male', 32.0, 0, 0, 8.05)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mr. Mauritz Hakan Bjornstrom-Steffansson', 'male', 28.0, 0, 0, 26.55)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mrs. Percival (Florence Kate White) Thorneycroft', 'female', 33.0, 1, 0, 16.1)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Mrs. Charles Alexander (Alice Adelaide Slow) Louch', 'female', 42.0, 1, 0, 26.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Nikolai Erland Kallio', 'male', 17.0, 0, 0, 7.125)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. William Baird Silvey', 'male', 50.0, 1, 0, 55.9)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Miss. Lucile Polk Carter', 'female', 14.0, 1, 2, 120.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Miss. Doolina Margaret Ford', 'female', 21.0, 2, 2, 34.375)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Mrs. Sidney (Emily Hocking) Richards', 'female', 24.0, 2, 3, 18.75)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. Mark Fortune', 'male', 64.0, 1, 4, 263.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Johan Henrik Johannesson Kvillner', 'male', 31.0, 0, 0, 10.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Mrs. Benjamin (Esther Ada Bloomfield) Hart', 'female', 45.0, 1, 1, 26.25)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Leon Hampe', 'male', 20.0, 0, 0, 9.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Johan Emil Petterson', 'male', 25.0, 1, 0, 7.775)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Ms. Encarnacion Reynaldo', 'female', 28.0, 0, 0, 13.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mr. Bernt Johannesen-Bratthammer', 'male', 29.0, 0, 0, 8.1125)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Master. Washington Dodge', 'male', 4.0, 0, 2, 81.8583)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Miss. Madeleine Violet Mellinger', 'female', 13.0, 0, 1, 19.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mr. Frederic Kimber Seward', 'male', 34.0, 0, 0, 26.55)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Miss. Marie Catherine Baclini', 'female', 5.0, 2, 1, 19.2583)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Major. Arthur Godfrey Peuchen', 'male', 52.0, 0, 0, 30.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Edwy Arthur West', 'male', 36.0, 1, 2, 27.75)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Ingvald Olai Olsen Hagland', 'male', 28.0, 1, 0, 19.9667)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)

VALUES (0, 1, 'Mr. Benjamin Laventall Foreman', 'male', 30.0, 0, 0, 27.75)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mr. Samuel L Goldenberg', 'male', 49.0, 1, 0, 89.1042)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Joseph Peduzzi', 'male', 24.0, 0, 0, 8.05)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mr. Ivan Jalsevac', 'male', 29.0, 0, 0, 7.8958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. Francis Davis Millet', 'male', 65.0, 0, 0, 26.55)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mrs. Frederick R (Marion) Kenyon', 'female', 41.0, 1, 0, 51.8625)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Miss. Ellen Toomey', 'female', 50.0, 0, 0, 10.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Maurice OConnor', 'male', 17.0, 0, 0, 7.75)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mr. Harry Anderson', 'male', 48.0, 0, 0, 26.55)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. William Morley', 'male', 34.0, 0, 0, 8.05)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. Arthur H Gee', 'male', 47.0, 0, 0, 38.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Jacob Christian Milling', 'male', 48.0, 0, 0, 13.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Simon Maisner', 'male', 34.0, 0, 0, 8.05)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Manuel Estanslas Goncalves', 'male', 38.0, 0, 0, 7.05)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. William Campbell', 'male', 21.0, 0, 0, 0.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. John Montgomery Smart', 'male', 56.0, 0, 0, 26.55)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. James Scanlan', 'male', 22.0, 0, 0, 7.725)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Miss. Helene Barbara Baclini', 'female', 0.75, 2, 1, 19.2583)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Arthur Keefe', 'male', 39.0, 0, 0, 7.25)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Luka Cacic', 'male', 38.0, 0, 0, 8.6625)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Mrs. Edwy Arthur (Ada Mary Worth) West', 'female', 33.0, 1, 2, 27.75)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Mrs. Amin S (Marie Marthe Thuillard) Jerwan', 'female', 23.0, 0, 0, 13.7917)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Miss. Ida Sofia Strandberg', 'female', 22.0, 0, 0, 9.8375)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. George Quincy Clifford', 'male', 40.0, 0, 0, 52.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Peter Henry Renouf', 'male', 34.0, 1, 0, 21.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Lewis Richard Braund', 'male', 29.0, 1, 0, 7.0458)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Nils August Karlsson', 'male', 22.0, 0, 0, 7.5208)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Miss. Hildur E Hirvonen', 'female', 2.0, 0, 1, 12.2875)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Master. Harold Victor Goodwin', 'male', 9.0, 5, 2, 46.9)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Anthony Wood Frost', 'male', 37.0, 0, 0, 0.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Richard Henry Rouse', 'male', 50.0, 0, 0, 8.05)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mrs. (Hedwig) Turkula', 'female', 63.0, 0, 0, 9.5875)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mr. Dickinson H Bishop', 'male', 25.0, 1, 0, 91.0792)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Miss. Jeannie Lefebre', 'female', 8.0, 3, 1, 25.4667)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mrs. Frederick Maxfield (Jane Anne Forby) Hoyt', 'female', 35.0, 1, 0, 90.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. Edward Austin Kent', 'male', 58.0, 0, 0, 29.7)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Francis William Somerton', 'male', 30.0, 0, 0, 8.05)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Master. Eden Leslie Coutts', 'male', 9.0, 1, 1, 15.9)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Konrad Mathias Reiersen Hagland', 'male', 19.0, 1, 0, 19.9667)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Einar Windelov', 'male', 21.0, 0, 0, 7.25)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. Harry Markland Molson', 'male', 55.0, 0, 0, 30.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. Ramon Artagaveytia', 'male', 71.0, 0, 0, 49.5042)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Edward Roland Stanley', 'male', 21.0, 0, 0, 8.05)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Gerious Yousseff', 'male', 26.0, 0, 0, 14.4583)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Miss. Elizabeth Mussey Eustis', 'female', 54.0, 1, 0, 78.2667)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Frederick William Shellard', 'male', 55.0, 0, 0, 15.1)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mrs. Hudson J C (Bessie Waldo Daniels) Allison', 'female', 25.0, 1, 2, 151.55)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Olof Svensson', 'male', 24.0, 0, 0, 7.7958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Petar Calic', 'male', 17.0, 0, 0, 8.6625)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Miss. Mary Canavan', 'female', 21.0, 0, 0, 7.75)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Miss. Bridget Mary OSullivan', 'female', 21.0, 0, 0, 7.6292)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Miss. Kristina Sofia Laitinen', 'female', 37.0, 0, 0, 9.5875)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Miss. Roberta Maioni', 'female', 16.0, 0, 0, 86.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. Victor de Satode Penasco y Castellana', 'male', 18.0, 1, 0, 108.9)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Mrs. Frederick Charles (Jane Richards) Quick', 'female', 33.0, 0, 2, 26.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mr. George Bradley', 'male', 37.0, 0, 0, 26.55)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Henry Margido Olsen', 'male', 28.0, 0, 0, 22.525)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mr. Fang Lang', 'male', 26.0, 0, 0, 56.4958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mr. Eugene Patrick Daly', 'male', 29.0, 0, 0, 7.75)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. James Webber', 'male', 66.0, 0, 0, 8.05)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mr. James Robert McGough', 'male', 36.0, 0, 0, 26.2875)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mrs. Martin (Elizabeth L. Barrett) Rothschild', 'female', 54.0, 1, 0, 59.4)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Satio Coleff', 'male', 24.0, 0, 0, 7.4958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. William Anderson Walker', 'male', 47.0, 0, 0, 34.0208)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Mrs. (Amelia Milley) Lemore', 'female', 34.0, 0, 0, 10.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Patrick Ryan', 'male', 30.0, 0, 0, 24.15)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Mrs. William A (Florence Agnes Hughes) Angle', 'female', 36.0, 1, 0, 26.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Stefo Pavlovic', 'male', 32.0, 0, 0, 7.8958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Miss. Anne Perreault', 'female', 30.0, 0, 0, 93.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Janko Vovk', 'male', 22.0, 0, 0, 7.8958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Sarkis Lahoud', 'male', 35.0, 0, 0, 7.225)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mrs. Louis Albert (Ida Sophia Fischer) Hippach', 'female', 44.0, 0, 1, 57.9792)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Fared Kassem', 'male', 18.0, 0, 0, 7.2292)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. James Farrell', 'male', 40.5, 0, 0, 7.75)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Miss. Lucy Ridsdale', 'female', 50.0, 0, 0, 10.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. John Farthing', 'male', 49.0, 0, 0, 221.7792)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Johan Werner Salonen', 'male', 39.0, 0, 0, 7.925)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Richard George Hocking', 'male', 23.0, 2, 1, 11.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Miss. Phyllis May Quick', 'female', 2.0, 1, 1, 26.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Nakli Toufik', 'male', 17.0, 0, 0, 7.2292)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Joseph Jr Elias', 'male', 17.0, 1, 1, 7.2292)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mrs. Catherine (Catherine Rizk) Peter', 'female', 24.0, 0, 2, 22.3583)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Miss. Marija Cacic', 'female', 30.0, 0, 0, 8.6625)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Miss. Eva Miriam Hart', 'female', 7.0, 0, 2, 26.25)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Major. Archibald Willingham Butt', 'male', 45.0, 0, 0, 26.55)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Miss. Bertha LeRoy', 'female', 30.0, 0, 0, 106.425)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Samuel Beard Risien', 'male', 69.0, 0, 0, 14.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Miss. Hedwig Margaritha Frolicher', 'female', 22.0, 0, 2, 49.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Miss. Harriet R Crosby', 'female', 36.0, 0, 2, 71.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Miss. Ingeborg Constanzia Andersson', 'female', 9.0, 4, 2, 31.275)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Miss. Sigrid Elisabeth Andersson', 'female', 11.0, 4, 2, 31.275)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Mr. Edward Beane', 'male', 32.0, 1, 0, 26.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. Walter Donald Douglas', 'male', 50.0, 1, 0, 106.425)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. Arthur Ernest Nicholson', 'male', 64.0, 0, 0, 26.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Mrs. Edward (Ethel Clarke) Beane', 'female', 19.0, 1, 0, 26.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Mr. Julian Padro y Manent', 'male', 27.0, 0, 0, 13.8625)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Frank John Goldsmith', 'male', 33.0, 1, 1, 20.525)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Master. John Morgan Jr Davies', 'male', 8.0, 1, 1, 36.75)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mr. John Borland Jr Thayer', 'male', 17.0, 0, 2, 110.8833)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Percival James R Sharp', 'male', 27.0, 0, 0, 26.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Timothy OBrien', 'male', 21.0, 0, 0, 7.8292)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mr. Fahim Leeni', 'male', 22.0, 0, 0, 7.225)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Miss. Velin Ohman', 'female', 22.0, 0, 0, 7.775)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. George Wright', 'male', 62.0, 0, 0, 26.55)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Lady. (Lucille Christiana Sutherland)Duff Gordon', 'female', 48.0, 1, 0, 39.6)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. Victor Robbins', 'male', 45.0, 0, 0, 227.525)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mrs. Emil (Tillie Mandelbaum) Taussig', 'female', 39.0, 1, 1, 79.65)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mrs. Guillaume Joseph (Emma) de Messemaeker', 'female', 36.0, 1, 0, 17.4)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Thomas Rowan Morrow', 'male', 30.0, 0, 0, 7.75)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Husein Sivic', 'male', 40.0, 0, 0, 7.8958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Robert Douglas Norman', 'male', 28.0, 0, 0, 13.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. John Simmons', 'male', 40.0, 0, 0, 8.05)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Miss. (Marion Ogden) Meanwell', 'female', 62.0, 0, 0, 8.05)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Alfred J Davies', 'male', 24.0, 2, 0, 24.15)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Ilia Stoytcheff', 'male', 19.0, 0, 0, 7.8958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mrs. Nils (Alma Cornelia Berglund) Palsson', 'female', 29.0, 0, 4, 21.075)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Tannous Doharr', 'male', 28.0, 0, 0, 7.2292)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mr. Carl Jonsson', 'male', 32.0, 0, 0, 7.8542)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Mr. George Harris', 'male', 62.0, 0, 0, 10.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mrs. Edward Dale (Charlotte Lamson) Appleton', 'female', 53.0, 2, 0, 51.4792)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mr. John Irwin Flynn', 'male', 36.0, 0, 0, 26.3875)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Miss. Mary Kelly', 'female', 22.0, 0, 0, 7.75)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Alfred George John Rush', 'male', 16.0, 0, 0, 8.05)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. George Patchett', 'male', 19.0, 0, 0, 14.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Miss. Ethel Garside', 'female', 34.0, 0, 0, 13.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mrs. William Baird (Alice Munger) Silvey', 'female', 39.0, 1, 0, 55.9)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mrs. Joseph (Maria Elias) Caram', 'female', 18.0, 1, 0, 14.4583)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mr. Eiriik Jussila', 'male', 32.0, 0, 0, 7.925)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Miss. Julie Rachel Christy', 'female', 25.0, 1, 1, 30.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mrs. John Borland (Marian Longstreth Morris) Thayer', 'female', 39.0, 1, 1, 110.8833)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. William James Downton', 'male', 54.0, 0, 0, 26.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. John Hugo Ross', 'male', 36.0, 0, 0, 40.125)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Uscher Paulner', 'male', 16.0, 0, 0, 8.7125)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Miss. Ruth Taussig', 'female', 18.0, 0, 2, 79.65)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. John Denzil Jarvis', 'male', 47.0, 0, 0, 15.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mr. Maxmillian Frolicher-Stehli', 'male', 60.0, 1, 1, 79.2)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Eliezer Gilinski', 'male', 22.0, 0, 0, 8.05)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Joseph Murdlin', 'male', 22.0, 0, 0, 8.05)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Matti Rintamaki', 'male', 35.0, 0, 0, 7.125)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mrs. Walter Bertram (Martha Eustis) Stephenson', 'female', 52.0, 1, 0, 78.2667)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. William James Elsbury', 'male', 47.0, 0, 0, 7.25)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Miss. Mary Bourke', 'female', 40.0, 0, 2, 7.75)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. John Henry Chapman', 'male', 37.0, 1, 0, 26.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Jean Baptiste Van Impe', 'male', 36.0, 1, 1, 24.15)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Miss. Jessie Wills Leitch', 'female', 31.0, 0, 0, 33.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Alfred Johnson', 'male', 49.0, 0, 0, 0.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Hanna Boulos', 'male', 18.0, 0, 0, 7.225)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Sir. Cosmo Edmund Duff Gordon', 'male', 49.0, 1, 0, 56.9292)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Mrs. Sidney Samuel (Amy Frances Christy) Jacobsohn', 'female', 24.0, 2, 1, 27.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Petco Slabenoff', 'male', 42.0, 0, 0, 7.8958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. Charles H Harrington', 'male', 37.0, 0, 0, 42.4)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Ernst William Torber', 'male', 44.0, 0, 0, 8.05)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mr. Harry Homer', 'male', 35.0, 0, 0, 26.55)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Edvard Bengtsson Lindell', 'male', 36.0, 1, 0, 15.55)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Milan Karaic', 'male', 30.0, 0, 0, 7.8958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mr. Robert Williams Daniel', 'male', 27.0, 0, 0, 30.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Mrs. Joseph (Juliette Marie Louise Lafargue) Laroche', 'female', 22.0, 1, 2, 41.5792)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Miss. Elizabeth W Shutes', 'female', 40.0, 0, 0, 153.4625)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mrs. Anders Johan (Alfrida Konstantia Brogren) Andersson', 'female', 39.0, 1, 5, 31.275)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Jose Neto Jardin', 'male', 21.0, 0, 0, 7.05)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Miss. Margaret Jane Murphy', 'female', 18.0, 1, 0, 15.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. John Horgan', 'male', 22.0, 0, 0, 7.75)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. William Alfred Brocklebank', 'male', 35.0, 0, 0, 8.05)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Miss. Alice Herman', 'female', 24.0, 1, 2, 65.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Ernst Gilbert Danbom', 'male', 34.0, 1, 1, 14.4)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mrs. William Arthur (Cordelia K Stanlick) Lobb', 'female', 26.0, 1, 0, 16.1)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Miss. Marion Louise Becker', 'female', 4.0, 2, 1, 39.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Lawrence Gavey', 'male', 26.0, 0, 0, 10.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Antoni Yasbeck', 'male', 27.0, 1, 0, 14.4542)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mr. Edwin Nelson Jr Kimball', 'male', 42.0, 1, 0, 52.5542)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mr. Sahid Nakid', 'male', 20.0, 1, 1, 15.7417)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Henry Damsgaard Hansen', 'male', 21.0, 0, 0, 7.8542)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. David John Bowen', 'male', 21.0, 0, 0, 16.1)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. Frederick Sutton', 'male', 61.0, 0, 0, 32.3208)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Rev. Charles Leonard Kirkland', 'male', 57.0, 0, 0, 12.35)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Miss. Gretchen Fiske Longley', 'female', 21.0, 0, 0, 77.9583)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Guentcho Bostandyeff', 'male', 26.0, 0, 0, 7.8958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Patrick D OConnell', 'male', 18.0, 0, 0, 7.7333)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mr. Algernon Henry Wilson Barkworth', 'male', 80.0, 0, 0, 30.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Johan Svensson Lundahl', 'male', 51.0, 0, 0, 7.0542)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Dr. Max Stahelin-Maeglin', 'male', 32.0, 0, 0, 30.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. William Henry Marsh Parr', 'male', 30.0, 0, 0, 0.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Miss. Mabel Skoog', 'female', 9.0, 3, 2, 27.9)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Miss. Mary Davis', 'female', 28.0, 0, 0, 13.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Antti Gustaf Leinonen', 'male', 32.0, 0, 0, 7.925)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Harvey Collyer', 'male', 31.0, 1, 1, 26.25)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mrs. Juha (Maria Emilia Ojala) Panula', 'female', 41.0, 0, 5, 39.6875)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Percival Thorneycroft', 'male', 37.0, 1, 0, 16.1)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Hans Peder Jensen', 'male', 20.0, 0, 0, 7.8542)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mlle. Emma Sagesser', 'female', 24.0, 0, 0, 69.3)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Miss. Margit Elizabeth Skoog', 'female', 2.0, 3, 2, 27.9)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mr. Choong Foo', 'male', 32.0, 0, 0, 56.4958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Miss. Eugenie Baclini', 'female', 0.75, 2, 1, 19.2583)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mr. Henry Sleeper Harper', 'male', 48.0, 1, 0, 76.7292)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Liudevit Cor', 'male', 19.0, 0, 0, 7.8958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Col. Oberst Alfons Simonius-Blumer', 'male', 56.0, 0, 0, 35.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Edward Willey', 'male', 21.0, 0, 0, 7.55)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Miss. Amy Zillah Elsie Stanley', 'female', 23.0, 0, 0, 7.55)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Mito Mitkoff', 'male', 23.0, 0, 0, 7.8958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Miss. Elsie Doling', 'female', 18.0, 0, 1, 23.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Johannes Halvorsen Kalvik', 'male', 21.0, 0, 0, 8.4333)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Miss. Hanora OLeary', 'female', 16.0, 0, 0, 7.8292)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Miss. Hanora Hegarty', 'female', 18.0, 0, 0, 6.75)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Leonard Mark Hickman', 'male', 24.0, 2, 0, 73.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Alexander Radeff', 'male', 27.0, 0, 0, 7.8958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mrs. John (Catherine) Bourke', 'female', 32.0, 1, 1, 15.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. George Floyd Eitemiller', 'male', 23.0, 0, 0, 13.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. Arthur Webster Newell', 'male', 58.0, 0, 2, 113.275)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Dr. Henry William Frauenthal', 'male', 50.0, 2, 0, 133.65)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Mohamed Badt', 'male', 40.0, 0, 0, 7.225)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. Edward Pomeroy Colley', 'male', 47.0, 0, 0, 25.5875)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Peju Coleff', 'male', 36.0, 0, 0, 7.4958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mr. Eino William Lindqvist', 'male', 20.0, 1, 0, 7.925)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Lewis Hickman', 'male', 32.0, 2, 0, 73.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Reginald Fenton Butler', 'male', 25.0, 0, 0, 13.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Knud Paust Rommetvedt', 'male', 49.0, 0, 0, 7.775)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Jacob Cook', 'male', 43.0, 0, 0, 8.05)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mrs. Elmer Zebley (Juliet Cummins Wright) Taylor', 'female', 48.0, 1, 0, 52.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Mrs. Thomas William Solomon (Elizabeth Catherine Ford) Brown', 'female', 40.0, 1, 1, 39.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. Thornton Davidson', 'male', 31.0, 1, 0, 52.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Henry Michael Mitchell', 'male', 70.0, 0, 0, 10.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Mr. Charles Wilhelms', 'male', 31.0, 0, 0, 13.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)

VALUES (0, 2, 'Mr. Ennis Hastings Watson', 'male', 19.0, 0, 0, 0.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Gustaf Hjalmar Edvardsson', 'male', 18.0, 0, 0, 7.775)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Frederick Charles Sawyer', 'male', 24.5, 0, 0, 8.05)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Miss. Anna Sofia Turja', 'female', 18.0, 0, 0, 9.8417)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mrs. Frederick (Augusta Tyler) Goodwin', 'female', 43.0, 1, 6, 46.9)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mr. Thomas Drake Martinez Cardeza', 'male', 36.0, 0, 1, 512.3292)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Miss. Katie Peters', 'female', 28.0, 0, 0, 8.1375)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mr. Hammad Hassab', 'male', 27.0, 0, 0, 76.7292)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Thor Anderson Olsvigen', 'male', 20.0, 0, 0, 9.225)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Charles Edward Goodwin', 'male', 14.0, 5, 2, 46.9)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Thomas William Solomon Brown', 'male', 60.0, 1, 1, 39.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Joseph Philippe Lemercier Laroche', 'male', 25.0, 1, 2, 41.5792)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Jaako Arnold Panula', 'male', 14.0, 4, 1, 39.6875)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Branko Dakic', 'male', 19.0, 0, 0, 10.1708)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Eberhard Thelander Fischer', 'male', 18.0, 0, 0, 7.7958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Miss. Georgette Alexandra Madill', 'female', 15.0, 0, 1, 211.3375)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mr. Albert Adrian Dick', 'male', 31.0, 1, 0, 57.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Miss. Manca Karun', 'female', 4.0, 0, 1, 13.4167)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mr. Ali Lam', 'male', 37.0, 0, 0, 56.4958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Khalil Saad', 'male', 25.0, 0, 0, 7.225)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Col. John Weir', 'male', 60.0, 0, 0, 26.55)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Charles Henry Chapman', 'male', 52.0, 0, 0, 13.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. James Kelly', 'male', 44.0, 0, 0, 8.05)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Miss. Katherine Mullens', 'female', 19.0, 0, 0, 7.7333)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. John Borland Thayer', 'male', 49.0, 1, 1, 110.8833)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Adolf Mathias Nicolai Olsen Humblen', 'male', 42.0, 0, 0, 7.65)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mrs. John Jacob (Madeleine Talmadge Force) Astor', 'female', 18.0, 1, 0, 227.525)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mr. Spencer Victor Silverthorne', 'male', 35.0, 0, 0, 26.2875)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Miss. Saiide Barbara', 'female', 18.0, 0, 1, 14.4542)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Martin Gallagher', 'male', 25.0, 0, 0, 7.7417)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Henrik Juul Hansen', 'male', 26.0, 1, 0, 7.8542)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Henry Samuel Morley', 'male', 39.0, 0, 0, 26.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Mrs. Florence Kelly', 'female', 45.0, 0, 0, 13.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mr. Edward Pennington Calderhead', 'male', 42.0, 0, 0, 26.2875)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Miss. Alice Cleaver', 'female', 22.0, 0, 0, 151.55)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Master. Halim Gonios Moubarek', 'male', 4.0, 1, 1, 15.2458)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mlle. Berthe Antonine Mayne', 'female', 24.0, 0, 0, 49.5042)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. Herman Klaber', 'male', 41.0, 0, 0, 26.55)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mr. Elmer Zebley Taylor', 'male', 48.0, 1, 0, 52.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. August Viktor Larsson', 'male', 29.0, 0, 0, 9.4833)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Samuel Greenberg', 'male', 52.0, 0, 0, 13.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Peter Andreas Lauritz Andersen Soholt', 'male', 19.0, 0, 0, 7.65)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Miss. Caroline Louise Endres', 'female', 38.0, 0, 0, 227.525)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Miss. Edwina Celia Troutt', 'female', 27.0, 0, 0, 10.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Malkolm Joackim Johnson', 'male', 33.0, 0, 0, 7.775)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Miss. Annie Jessie Harper', 'female', 6.0, 0, 1, 33.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Svend Lauritz Jensen', 'male', 17.0, 1, 0, 7.0542)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. William Henry Gillespie', 'male', 34.0, 0, 0, 13.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Henry Price Hodges', 'male', 50.0, 0, 0, 13.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mr. Norman Campbell Chambers', 'male', 27.0, 1, 0, 53.1)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Luka Oreskovic', 'male', 20.0, 0, 0, 8.6625)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Mrs. Peter Henry (Lillian Jefferys) Renouf', 'female', 30.0, 3, 0, 21.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Miss. Margareth Mannion', 'female', 28.0, 0, 0, 7.7375)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Kurt Arnold Gottfrid Bryhl', 'male', 25.0, 1, 0, 26.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Miss. Pieta Sofia Ilmakangas', 'female', 25.0, 1, 0, 7.925)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Miss. Elisabeth Walton Allen', 'female', 29.0, 0, 0, 211.3375)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Houssein G N Hassan', 'male', 11.0, 0, 0, 18.7875)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Robert J Knight', 'male', 41.0, 0, 0, 0.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. William John Berriman', 'male', 23.0, 0, 0, 13.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Moses Aaron Troupiansky', 'male', 23.0, 0, 0, 13.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Leslie Williams', 'male', 28.5, 0, 0, 16.1)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mrs. Edward (Margaret Ann Watson) Ford', 'female', 48.0, 1, 3, 34.375)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mr. Gustave J Lesurer', 'male', 35.0, 0, 0, 512.3292)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Kanio Ivanoff', 'male', 20.0, 0, 0, 7.8958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Minko Nankoff', 'male', 32.0, 0, 0, 7.8958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mr. Walter James Hawksford', 'male', 45.0, 0, 0, 30.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. Tyrell William Cavendish', 'male', 36.0, 1, 0, 78.85)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Miss. Susan Parker Ryerson', 'female', 21.0, 2, 2, 262.375)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Neal McNamee', 'male', 24.0, 1, 0, 16.1)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mr. Juho Stranden', 'male', 31.0, 0, 0, 7.925)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Capt. Edward Gifford Crosby', 'male', 70.0, 1, 1, 71.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Rossmore Edward Abbott', 'male', 16.0, 1, 1, 20.25)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Miss. Anna Sinkkonen', 'female', 30.0, 0, 0, 13.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. Daniel Warner Marvin', 'male', 19.0, 1, 0, 53.1)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Michael Connaghton', 'male', 31.0, 0, 0, 7.75)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Miss. Joan Wells', 'female', 4.0, 1, 1, 23.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Master. Meier Moor', 'male', 6.0, 0, 1, 12.475)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Johannes Joseph Vande Velde', 'male', 33.0, 0, 0, 9.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Lalio Jonkoff', 'male', 23.0, 0, 0, 7.8958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Mrs. Samuel (Jane Laver) Herman', 'female', 48.0, 1, 2, 65.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Master. Viljo Hamalainen', 'male', 0.67, 1, 1, 14.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. August Sigfrid Carlsson', 'male', 28.0, 0, 0, 7.7958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Percy Andrew Bailey', 'male', 18.0, 0, 0, 11.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Thomas Leonard Theobald', 'male', 34.0, 0, 0, 8.05)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'the Countess. of (Lucy Noel Martha Dyer-Edwards) Rothes', 'female', 33.0, 0, 0, 86.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. John Garfirth', 'male', 23.0, 0, 0, 14.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Iisakki Antino Aijo Nirva', 'male', 41.0, 0, 0, 7.125)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mr. Hanna Assi Barah', 'male', 20.0, 0, 0, 7.2292)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mrs. William Ernest (Lucile Polk) Carter', 'female', 36.0, 1, 2, 120.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)

VALUES (0, 3, 'Mr. Hans Linus Eklund', 'male', 16.0, 0, 0, 7.775)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mrs. John C (Anna Andrews) Hogeboom', 'female', 51.0, 1, 0, 77.9583)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Dr. Arthur Jackson Brewe', 'male', 46.0, 0, 0, 39.6)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Miss. Mary Mangan', 'female', 30.5, 0, 0, 7.75)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Daniel J Moran', 'male', 28.0, 1, 0, 24.15)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Daniel Danielsen Gronnestad', 'male', 32.0, 0, 0, 8.3625)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Rene Aime Lievens', 'male', 24.0, 0, 0, 9.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Niels Peder Jensen', 'male', 48.0, 0, 0, 7.8542)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mrs. (Mary) Mack', 'female', 57.0, 0, 0, 10.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Dibo Elias', 'male', 29.0, 0, 0, 7.225)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Mrs. Elizabeth (Eliza Needs) Hocking', 'female', 54.0, 1, 3, 23.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Pehr Fabian Oliver Malkolm Myhrman', 'male', 18.0, 0, 0, 7.75)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Roger Tobin', 'male', 20.0, 0, 0, 7.75)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Miss. Virginia Ethel Emanuel', 'female', 5.0, 0, 0, 12.475)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Thomas J Kilgannon', 'male', 22.0, 0, 0, 7.7375)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mrs. Edward Scott (Elisabeth Walton McMillan) Robert', 'female', 43.0, 0, 1, 211.3375)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Miss. Banoura Ayoub', 'female', 13.0, 0, 0, 7.2292)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mrs. Albert Adrian (Vera Gillespie) Dick', 'female', 17.0, 1, 0, 57.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. Milton Clyde Long', 'male', 29.0, 0, 0, 30.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Andrew G Johnston', 'male', 35.0, 1, 2, 23.45)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. William Ali', 'male', 25.0, 0, 0, 7.05)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Abraham (David Lishin) Harmer', 'male', 25.0, 0, 0, 7.25)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Miss. Anna Sofia Sjoblom', 'female', 18.0, 0, 0, 7.4958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Master. George Hugh Rice', 'male', 8.0, 4, 1, 29.125)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Master. Bertram Vere Dean', 'male', 1.0, 1, 2, 20.575)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. Benjamin Guggenheim', 'male', 46.0, 0, 0, 79.2)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Andrew Keane', 'male', 20.0, 0, 0, 7.75)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Alfred Gaskell', 'male', 16.0, 0, 0, 26.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Miss. Stella Anna Sage', 'female', 21.0, 8, 2, 69.55)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. William Fisher Hoyt', 'male', 43.0, 0, 0, 30.6958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Ristiu Dantcheff', 'male', 25.0, 0, 0, 7.8958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Richard Otter', 'male', 39.0, 0, 0, 13.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Dr. Alice (Farnham) Leader', 'female', 49.0, 0, 0, 25.9292)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mrs. Mara Osman', 'female', 31.0, 0, 0, 8.6833)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Yousseff Ibrahim Shawah', 'male', 30.0, 0, 0, 7.2292)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mrs. Jean Baptiste (Rosalie Paula Govaert) Van Impe', 'female', 30.0, 1, 1, 24.15)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Martin Ponesell', 'male', 34.0, 0, 0, 13.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Mrs. Harvey (Charlotte Annie Tate) Collyer', 'female', 31.0, 1, 1, 26.25)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Master. William Thornton II Carter', 'male', 11.0, 1, 2, 120.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Master. Assad Alexander Thomas', 'male', 0.42, 0, 1, 8.5167)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mr. Oskar Arvid Hedman', 'male', 27.0, 0, 0, 6.975)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Karl Johan Johansson', 'male', 31.0, 0, 0, 7.775)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. Thomas Jr Andrews', 'male', 39.0, 0, 0, 0.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Miss. Ellen Natalia Pettersson', 'female', 18.0, 0, 0, 7.775)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. August Meyer', 'male', 39.0, 0, 0, 13.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mrs. Norman Campbell (Bertha Griggs) Chambers', 'female', 33.0, 1, 0, 53.1)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. William Alexander', 'male', 26.0, 0, 0, 7.8875)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. James Lester', 'male', 39.0, 0, 0, 24.15)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Richard James Slemen', 'male', 35.0, 0, 0, 10.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Miss. Ebba Iris Alfrida Andersson', 'female', 6.0, 4, 2, 31.275)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Ernest Portage Tomlin', 'male', 30.5, 0, 0, 8.05)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. Richard Fry', 'male', 39.0, 0, 0, 0.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Miss. Wendla Maria Heininen', 'female', 23.0, 0, 0, 7.925)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Albert Mallet', 'male', 31.0, 1, 1, 37.0042)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. John Fredrik Alexander Holm', 'male', 43.0, 0, 0, 6.45)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Master. Karl Thorsten Skoog', 'male', 10.0, 3, 2, 27.9)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mrs. Charles Melville (Clara Jennings Gregg) Hays', 'female', 52.0, 1, 1, 93.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mr. Nikola Lulic', 'male', 27.0, 0, 0, 8.6625)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Jonkheer. John George Reuchlin', 'male', 38.0, 0, 0, 0.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mrs. (Beila) Moor', 'female', 27.0, 0, 1, 12.475)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Master. Urho Abraham Panula', 'male', 2.0, 4, 1, 39.6875)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. John Flynn', 'male', 36.0, 0, 0, 6.95)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Len Lam', 'male', 23.0, 0, 0, 56.4958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Master. Andre Mallet', 'male', 1.0, 0, 2, 37.0042)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mr. Thomas Joseph McCormack', 'male', 19.0, 0, 0, 7.75)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mrs. George Nelson (Martha Evelyn) Stone', 'female', 62.0, 0, 0, 80.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mrs. Antoni (Selini Alexander) Yasbeck', 'female', 15.0, 1, 0, 14.4542)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Master. George Sibley Richards', 'male', 0.83, 1, 1, 18.75)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Amin Saad', 'male', 30.0, 0, 0, 7.2292)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Albert Augustsson', 'male', 23.0, 0, 0, 7.8542)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Owen George Allum', 'male', 18.0, 0, 0, 8.3)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Miss. Sara Rebecca Compton', 'female', 39.0, 1, 1, 83.1583)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Jakob Pasic', 'male', 21.0, 0, 0, 8.6625)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Maurice Sirota', 'male', 20.0, 0, 0, 8.05)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mr. Chang Chip', 'male', 32.0, 0, 0, 56.4958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mr. Pierre Marechal', 'male', 29.0, 0, 0, 29.7)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Ilmari Rudolf Alhomaki', 'male', 20.0, 0, 0, 7.925)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Thomas Charles Mudd', 'male', 16.0, 0, 0, 10.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Miss. Augusta Serepeca', 'female', 30.0, 0, 0, 31.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Peter L Lemberopolous', 'male', 34.5, 0, 0, 6.4375)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Jeso Culumovic', 'male', 17.0, 0, 0, 8.6625)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Anthony Abbing', 'male', 42.0, 0, 0, 7.55)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Douglas Bullen Sage', 'male', 18.0, 8, 2, 69.55)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Marin Markoff', 'male', 35.0, 0, 0, 7.8958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Rev. John Harper', 'male', 28.0, 0, 1, 33.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mrs. Samuel L (Edwiga Grabowska) Goldenberg', 'female', 40.0, 1, 0, 89.1042)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Master. Sigvard Harald Elias Andersson', 'male', 4.0, 4, 2, 31.275)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Johan Svensson', 'male', 74.0, 0, 0, 7.775)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Miss. Nourelain Boulos', 'female', 9.0, 1, 1, 15.2458)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Miss. Mary Conover Lines', 'female', 16.0, 0, 1, 39.4)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mrs. Ernest Courtenay (Lilian Hughes) Carter', 'female', 44.0, 1, 0, 26.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mrs. Sam (Leah Rosen) Aks', 'female', 18.0, 0, 1, 9.35)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mrs. George Dennick (Mary Hitchcock) Wick', 'female', 45.0, 1, 1, 164.8667)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mr. Peter Denis Daly', 'male', 51.0, 0, 0, 26.55)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Mrs. Solomon (Latifa Qurban) Baclini', 'female', 24.0, 0, 3, 19.2583)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Raihed Razi', 'male', 30.0, 0, 0, 7.2292)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Claus Peter Hansen', 'male', 41.0, 2, 0, 14.1083)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Frederick Edward Giles', 'male', 21.0, 1, 0, 11.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mrs. Frederick Joel (Margaret Welles Barron) Swift', 'female', 48.0, 0, 0, 25.9292)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Miss. Dorothy Edith Sage', 'female', 14.0, 8, 2, 69.55)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. John William Gill', 'male', 24.0, 0, 0, 13.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Mrs. (Karolina) Bystrom', 'female', 42.0, 0, 0, 13.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Miss. Asuncion Duran y More', 'female', 27.0, 1, 0, 13.8583)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. Washington Augustus II Roebling', 'male', 31.0, 0, 0, 50.4958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Philemon van Melkebeke', 'male', 23.0, 0, 0, 9.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Master. Harold Theodor Johnson', 'male', 4.0, 1, 1, 11.1333)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Cerin Balkic', 'male', 26.0, 0, 0, 7.8958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mrs. Richard Leonard (Sallie Monypeny) Beckwith', 'female', 47.0, 1, 1, 52.5542)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 1, 'Mr. Frans Olof Carlsson', 'male', 33.0, 0, 0, 5.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Victor Vander Cruyssen', 'male', 47.0, 0, 0, 9.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Mrs. Samuel (Hannah Wizosky) Abelson', 'female', 28.0, 1, 0, 24.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 3, 'Miss. Adele Kiamie Najib', 'female', 15.0, 0, 0, 7.225)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Alfred Ossian Gustafsson', 'male', 20.0, 0, 0, 9.8458)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Nedelio Petroff', 'male', 19.0, 0, 0, 7.8958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Kristo Laleff', 'male', 23.0, 0, 0, 7.8958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mrs. Thomas Jr (Lily Alexenia Wilson) Potter', 'female', 56.0, 0, 1, 83.1583)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 2, 'Mrs. William (Imanita Parrish Hall) Shelley', 'female', 25.0, 0, 1, 26.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Johann Markun', 'male', 33.0, 0, 0, 7.8958)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Miss. Gerda Ulrika Dahlberg', 'female', 22.0, 0, 0, 10.5167)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Mr. Frederick James Banfield', 'male', 28.0, 0, 0, 10.5)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Henry Jr Sutehall', 'male', 25.0, 0, 0, 7.05)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mrs. William (Margaret Norton) Rice', 'female', 39.0, 0, 5, 29.125)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 2, 'Rev. Juozas Montvila', 'male', 27.0, 0, 0, 13.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Miss. Margaret Edith Graham', 'female', 19.0, 0, 0, 30.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Miss. Catherine Helen Johnston', 'female', 7.0, 1, 2, 23.45)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (1, 1, 'Mr. Karl Howell Behr', 'male', 26.0, 0, 0, 30.0)

INSERT INTO titanic_table
(Survived, Pclass, Name, Sex, Age, Siblings_Spouses_Aboard, Parents_Children_Aboard, Fare)
VALUES (0, 3, 'Mr. Patrick Dooley', 'male', 32.0, 0, 0, 7.75)
None

In [17]:
pg_curs.close()
pg_conn.commit()

In [18]:
sl_curs.close()
sl_conn.commit()